bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
// Copyright 2020-2025 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <common/bk_include.h>
#include "sys_hal.h"
#include "sys_ll.h"
#include "sys_ahbp_ll.h"
#include "sys_aonp_struct.h"
#include "aon_pmu_hal.h"
#include "gpio_hal_v2px.h"
#include "gpio_driver_base.h"
#include "sys_types.h"
#include <driver/aon_rtc.h>
#include <driver/hal/hal_spi_types.h>
#include <driver/hal/hal_qspi_types.h>
#include <gpio_driver.h>
#include "timer_hal.h"
#include <driver/pwr_clk.h>
#include "bk_misc.h"
#include "cpu_id.h"
#include <driver/psram_types.h>
#include <driver/xdac_types.h>
#include <modules/pm.h>

#define PM_CLKSEL_CORE_320M                 (2)
#define PM_CLKSEL_CORE_480M                 (3)
#define PM_CLKSEL_FLASH_480M                (0x1)
#define PM_CLKDIV_CORE_0                    (0)
#define PM_CLKDIV_CORE_1                    (1)
#define PM_VDDD_H_VOL_1V                    (0x6)
#define PM_VDDDIG_H_VOL_0v9                 (0xC)
#define PM_CLKDV_CPU1_1                     (0x1)
#define PM_CLKDV_CPU0_0                     (0x0)
#define SYS_SWITCH_VDDDIG_VOL_DELAY_TIME    (2600)


#define PM_CLOCK_MODE_0_POS                 (0)
#define PM_CLOCK_MODE_1_POS                 (32)
#define PM_CLOCK_MODE_2_POS                 (64)

static sys_hal_t s_sys_hal;
static uint32_t s_pm_wireless_clock_state = 0;

// static pm_cpu_freq_e s_pre_cpu_freq = PM_CPU_FRQ_120M;
uint32 sys_hal_get_int_group2_status(uint32_t core_id);
bk_err_t sys_hal_ctrl_vddd_h_vol(uint32_t vol_value);
bk_err_t sys_hal_ctrl_vdddig_h_vol(uint32_t vol_value);
uint32_t sys_hal_vdddig_h_vol_get();
static void sys_hal_delay(volatile uint32_t times);
static bk_err_t sys_hal_m55_clock_power_init();
static bk_err_t sys_hal_m55_clock_power_init();
__IRAM_SEC int32 sys_hal_module_power_state_get(power_module_name_t module);
static bk_err_t sys_hal_ap_clock_power_ctrl(power_module_state_t power_state);

bk_err_t sys_hal_init()
{
	s_sys_hal.hw = (sys_hw_t *)SOC_SYS_REG_BASE;
	return BK_OK;
}

void sys_hal_usb_enable_clk(bool en)
{
	return;
}

void sys_hal_usb_analog_phy_en(bool en)
{
	return;
}

void sys_hal_set_ana_reg_spi_latch1v(uint32_t v)
{
	sys_ll_set_ana_reg10_spi_latch1v(v);
	return;
}

void sys_hal_set_ioldo_bypass(uint32_t v)
{
	return;
}

void sys_hal_set_ioldo_volt(uint32_t v)
{
	return;
}

void sys_hal_flash_set_dco(void)
{
	sys_ll_set_cpu_clk_div_mode1_cksel_flash(FLASH_CLK_DPLL);
}

void sys_hal_flash_set_dpll(void)
{
	sys_ll_set_cpu_clk_div_mode1_cksel_flash(FLASH_CLK_APLL);
}

void sys_hal_flash_set_clk(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_cksel_flash(value);
}

void sys_hal_flash_set_clk_div(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_ckdiv_flash(value);
}

uint32_t sys_hal_flash_get_clk_sel(void)
{
	return sys_ll_get_cpu_clk_div_mode1_cksel_flash();
}

uint32_t sys_hal_flash_get_clk_div(void)
{
	return sys_ll_get_cpu_clk_div_mode1_ckdiv_flash();
}
bk_err_t sys_hal_phy_ctrl(power_module_name_t module,power_module_state_t power_state)
{
	bk_err_t ret = BK_OK;
	if ((0x0 == sys_hal_module_power_state_get(module))&& (bk_pm_phy_cali_state_get() == true))
	{
		//BK_LOGD(NULL, "phy power on already\r\n");
	}
	else
	{
		if (sys_hal_module_power_state_get(module))
		{
			sys_ll_set_reserver_reg0x10_pwd_wrls(0);
		}

		if (0x0 == sys_hal_module_power_state_get(module))
		{
			if((bk_pm_vote_power_module_get() == PM_POWER_SUB_DOMAIN_PHY) || 
			(bk_pm_vote_power_module_get() == PM_POWER_SUB_DOMAIN_BTDM))
			{
				#if CONFIG_WIFI_ENABLE
				extern void phy_wakeup_reinit(uint8 is_wifi);
				phy_wakeup_reinit(bk_pm_vote_power_module_get() == PM_POWER_SUB_DOMAIN_PHY);
				#elif CONFIG_BLUETOOTH
				extern void phy_wakeup_for_bluetooth();
				phy_wakeup_for_bluetooth();
				#else
				#endif
				bk_pm_phy_reinit_flag_set(true);
				bk_pm_phy_cali_state_set(true);
			}

		}
		else
		{
			//BK_LOGD(NULL, "phy power on fail 0x%x\r\n", sys_hal_module_power_state_get(module));
			ret = BK_FAIL;
		}
	}
	return ret;
}
__IRAM_SEC void sys_hal_module_power_ctrl(power_module_name_t module,power_module_state_t power_state)
{
	if(POWER_MODULE_NAME_BASE1 < module && module <= POWER_MODULE_NAME_NONE)
	{
		switch(module)
		{
			case PM_POWER_DOMAIN_0://POWER_DOMAIN_NAME_CP_CPU1_BAKP_AUDP:
				if(power_state == POWER_MODULE_STATE_ON)
				{
					sys_ll_set_reserver_reg0x10_pwd_cpu1(0);
				}
				else
				{
					sys_ll_set_reserver_reg0x10_pwd_cpu1(1);
				}
				break;
			case PM_POWER_DOMAIN_1://POWER_DOMAIN_NAME_VEHP_SPI_DEBUG:
				if(power_state == POWER_MODULE_STATE_ON)
				{
					sys_ll_set_reserver_reg0x10_pwd_vehp(0);
				}
				else
				{
					sys_ll_set_reserver_reg0x10_pwd_vehp(1);
				}
				break;
			case PM_POWER_DOMAIN_2://POWER_DOMAIN_NAME_WRLP_ENCP:
				if(power_state == POWER_MODULE_STATE_ON)
				{
					sys_hal_phy_ctrl(module, power_state);
					if(sys_ll_get_reserver_reg0x10_pwd_wrls() == 1)
					{
						sys_ll_set_reserver_reg0x10_pwd_wrls(0);
					}
				}
				else
				{
					bk_pm_phy_cali_state_set(false);
					sys_ll_set_reserver_reg0x10_pwd_wrls(1);
				}
				break;
			case PM_POWER_DOMAIN_3://POWER_DOMAIN_NAME_AP_CPU:
				if(power_state == POWER_MODULE_STATE_ON)
				{
					//sys_hal_ap_clock_power_ctrl(power_state);
					sys_hal_m55_clock_power_init();
				}
				else
				{
					sys_hal_ap_clock_power_ctrl(power_state);
				}
				break;
			case PM_POWER_DOMAIN_4://POWER_DOMAIN_NAME_HSSUB_POWER:
				if(power_state == POWER_MODULE_STATE_ON)
				{
					sys_hal_m55_clock_power_init();
				}
				else
				{

