bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
				}
				break;
			default:
				break;
		}
	}
}

__IRAM_SEC int32 sys_hal_module_power_state_get(power_module_name_t module)
{
	if(POWER_MODULE_NAME_BASE1 < module && module <= POWER_MODULE_NAME_NONE)
	{
		switch(module)
		{
			case PM_POWER_DOMAIN_0://POWER_DOMAIN_NAME_CP_CPU1_BAKP_AUDP:
				return sys_ll_get_reserver_reg0x10_pwd_cpu1();
				break;
			case PM_POWER_DOMAIN_1://POWER_DOMAIN_NAME_VEHP_SPI_DEBUG:
				return sys_ll_get_reserver_reg0x10_pwd_vehp();
				break;
			case PM_POWER_DOMAIN_2://POWER_DOMAIN_NAME_WRLP_ENCP:
				return sys_ll_get_reserver_reg0x10_pwd_wrls();
				break;
			case PM_POWER_DOMAIN_3://POWER_DOMAIN_NAME_AP_CPU:
				return sys_ahbp_ll_get_rege_pwd_m55();
				break;
			case PM_POWER_DOMAIN_4://POWER_DOMAIN_NAME_HSSUB_POWER:
				return 0;//to do it
				break;
			default:
				break;
		}
	}
	return 0;
}

int sys_hal_rosc_calibration(uint32_t rosc_cali_mode, uint32_t cali_interval)
{
	sys_ll_set_ana_reg5_spilatchb_rc32k(1);
	// sys_ll_set_ana_reg6_manu_ena(0);
	// sys_ll_set_ana_reg6_modifi_auto(0);
	// sys_ll_set_ana_reg6_calib_auto(0);
	// sys_ll_set_ana_reg6_spi_trig(0);

	if (rosc_cali_mode == 0) { //Auto
		sys_ll_set_ana_reg6_cal_mode(1);
		sys_ll_set_ana_reg6_calib_auto(1);
		sys_ll_set_ana_reg6_xtal_wakeup_time(8);
		sys_ll_set_ana_reg6_calib_interval(cali_interval);
		sys_ll_set_ana_reg6_spi_trig(1);
	} else if (rosc_cali_mode == 1) { //Manual
		sys_ll_set_ana_reg6_manu_ena(1);
		sys_ll_set_ana_reg6_manu_cin(cali_interval);
		sys_ll_set_ana_reg6_calib_interval(cali_interval >> 16);
	} else if (rosc_cali_mode == 2) { //Modify
		sys_ll_set_ana_reg6_cal_mode(1);
		sys_ll_set_ana_reg6_modifi_auto(1);
		sys_ll_set_ana_reg6_xtal_wakeup_time(8);
		sys_ll_set_ana_reg6_modify_interval(cali_interval);
		sys_ll_set_ana_reg6_spi_trig(1);
	} else if (rosc_cali_mode == 3) { //Trigger
		sys_ll_set_ana_reg6_cal_mode(1);
		sys_ll_set_ana_reg6_spi_trig(1);
	} else { //Disable
	}

	return BK_OK;
}

int sys_hal_rosc_test_mode(bool enabled)
{
	if (enabled) {
		//TODO:sys_ll_set_ana_reg4_ck_tst_enbale(1);
		//TODO:sys_ll_set_ana_reg4_cktst_sel(0);
		//TODO:sys_ll_set_ana_reg5_rosc_tsten(1);
		//TODO:sys_ll_set_ana_reg6_cal_mode(1);
		REG_WRITE((SOC_AON_GPIO_REG_BASE + (24 << 2)), 0x40);
	} else {
		//TODO:sys_ll_set_ana_reg4_ck_tst_enbale(0);
		//TODO:sys_ll_set_ana_reg4_cktst_sel(0);
		//TODO:sys_ll_set_ana_reg5_rosc_tsten(0);
		//TODO:sys_ll_set_ana_reg6_cal_mode(0);
		//TODO:sys_ll_set_ana_reg6_calib_auto(0);
	}
	return BK_OK;
}

void sys_hal_module_RF_power_ctrl (module_name_t module,power_module_state_t power_state)
{
        uint32_t value = 0;
        //TODO:value = sys_ana_ll_get_reg6_value();
        if(power_state == POWER_MODULE_STATE_ON)//power on
        {
        }
        else //power down
        {
                value &= ~(1 << 12);//en_dpll
                value &= ~(1 << 11);//en_audpll
                value &= ~(1 << 8);//en_dco
                value &= ~(1 << 7);//en_xtall
        }
        (void)value;
        //TODO:sys_ll_set_ana_reg6_value(value);
}

void sys_hal_cpu0_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
    sys_ll_set_cpu0_int_halt_clk_op_cpu_int_mask( clock_state);
}

void sys_hal_cpu1_main_int_ctrl(dev_clk_pwr_ctrl_t clock_state)
{
    sys_ll_set_cpu0_int_halt_clk_op_cpu_int_mask( clock_state);
}

void sys_hal_set_cpu1_boot_address_offset(uint32_t address_offset)
{
	sys_ll_set_cpu1_int_halt_clk_op_cpu1_offset(address_offset);
}

void sys_hal_set_cpu2_boot_address_offset(uint32_t address_offset)
{
	sys_ahbp_ll_set_reg4_cpu0_offset(address_offset);
}

void sys_hal_set_cpu1_reset(uint32_t reset_value)
{
	sys_ll_set_cpu1_int_halt_clk_op_cpu1_sw_rst(reset_value);
}

void sys_hal_set_cpu2_reset(uint32_t reset_value)
{
	sys_ahbp_ll_set_reg4_cpu0_sw_rstn(reset_value);
}

void sys_hal_set_cpu1_pwr_dw(uint32_t is_pwr_down)
{
	return;
}

void sys_hal_set_cpu2_pwr_dw(uint32_t is_pwr_down)
{
	return;
}

void sys_hal_all_modules_clk_div_set(clk_div_reg_e reg, uint32_t value)
{
        clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
        clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

        uint32_t clk_div_reg_address = clk_div_addr->reg_address;

        REG_WRITE(clk_div_reg_address, value);
}

uint32_t sys_hal_all_modules_clk_div_get(clk_div_reg_e reg)
{
        clk_div_address_map_t clk_div_address_map_table[] = CLK_DIV_ADDRESS_MAP;
        clk_div_address_map_t *clk_div_addr = &clk_div_address_map_table[reg];

        uint32_t clk_div_reg_address = clk_div_addr->reg_address;

        return REG_READ(clk_div_reg_address);
}
void sys_hal_cpu_clk_div_set(uint32_t core_index, uint32_t value)
{
	return;
}
uint32_t sys_hal_cpu_clk_div_get(uint32_t core_index)
{
	return 0;
}
void sys_hal_set_iobyapssen(uint32_t enable)
{
	return;
}
void sys_hal_set_violdosel(uint32_t flag)
{
	return;
}
void sys_hal_lp_anabuf_set(uint32_t v) {
	return;
}
int32 sys_hal_lp_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg10_spi_latch1v(1);
	sys_ll_set_ana_reg10_vcorelsel(value);
	sys_ll_set_ana_reg10_spi_latch1v(0);
	return BK_OK;
}
uint32_t sys_hal_lp_vol_get()
{
	return sys_ll_get_ana_reg10_vcorelsel();
}
int32 sys_hal_rf_tx_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg10_spi_latch1v(1);
	sys_ll_set_ana_reg9_t_vanaldosel(value);
	sys_ll_set_ana_reg10_spi_latch1v(0);
	return BK_OK;
}

uint32_t sys_hal_rf_tx_vol_get()
{
	return sys_ll_get_ana_reg9_t_vanaldosel();
}
int32 sys_hal_rf_rx_vol_set(uint32_t value)
{
	sys_ll_set_ana_reg10_spi_latch1v(1);
	sys_ll_set_ana_reg9_r_vanaldosel(value);
	sys_ll_set_ana_reg10_spi_latch1v(0);
	return BK_OK;
}

uint32_t sys_hal_rf_rx_vol_get()
{
	return sys_ll_get_ana_reg9_r_vanaldosel();
}

int32 sys_hal_bandgap_cali_set(uint32_t value)//increase or decrease the dvdddig voltage
{
	return 0;
}

uint32_t sys_hal_bandgap_cali_get()
{
	return 0;
}
bk_err_t sys_hal_core_bus_clock_ctrl(uint32_t cksel_core, uint32_t ckdiv_core,uint32_t ckdiv_bus, uint32_t ckdiv_cpu0,uint32_t ckdiv_cpu1)
{
	uint32_t clk_param  = 0;
	if(cksel_core > PM_CLKSEL_CORE_MAX)
	{
		os_printf("Set dvfs cksel core > %d invalid\r\n",PM_CLKSEL_CORE_MAX);
		return BK_FAIL;
	}

	if((ckdiv_core > PM_FREQUNCY_DIV_MAX))
	{
		os_printf("Set dvfs ckdiv_core > %d invalid\r\n",PM_FREQUNCY_DIV_MAX);
		return BK_FAIL;
	}
	if(((cksel_core == PM_CLKSEL_CORE_320M)&&(ckdiv_core == PM_CLKDIV_CORE_0))||((cksel_core == PM_CLKSEL_CORE_480M)&&(ckdiv_core == PM_CLKDIV_CORE_0)))
	{
		os_printf("unsupport the cpu freq setting %d %d \r\n",cksel_core,ckdiv_core);
		return BK_FAIL;
	}

