bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
	clk_param = 0;
	clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
	if(((clk_param >> 0x0)&0x3) > cksel_core)//when it from the higher frequency to lower frequency
	{
		/*1.core clk select*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x3 << 0);
		clk_param |=  cksel_core << 0;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*2.config bus and core clk div*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0xF << 2);
		clk_param |=  ckdiv_core << 2;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);
	}
	else//when it from the lower frequency to higher frequency
	{
		/*1.config bus and core clk div*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0xF << 2);
		clk_param |=  ckdiv_core << 2;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);

		/*2.core clk select*/
		clk_param = 0;
		clk_param = sys_hal_all_modules_clk_div_get(CLK_DIV_REG0);
		clk_param &=  ~(0x3 << 0);
		clk_param |=  cksel_core << 0;
		sys_hal_all_modules_clk_div_set(CLK_DIV_REG0,clk_param);
	}

	return BK_OK;
}

bk_err_t sys_hal_ctrl_vddd_h_vol(uint32_t vol_value)
{
	/*TODO: implement the function; default:1.0v*/
	return BK_OK;
}

bk_err_t sys_hal_ctrl_vdddig_h_vol(uint32_t vol_value)
{
	if(sys_ll_get_ana_reg10_vcorehsel() != vol_value)
	{
		sys_ll_set_ana_reg10_spi_latch1v(1);
		sys_ll_set_ana_reg10_vcorehsel(vol_value);
		sys_ll_set_ana_reg10_spi_latch1v(0);
		sys_hal_delay(SYS_SWITCH_VDDDIG_VOL_DELAY_TIME);//when cpu0 max freq 240m ,it delay 10uS for voltage stability
	}

	return BK_OK;
}

uint32_t sys_hal_vdddig_h_vol_get()
{
	return sys_ll_get_ana_reg10_vcorehsel();
}
bk_err_t sys_hal_switch_cpu_bus_freq_high_to_low(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;
	switch(cpu_bus_freq)
	{
		case PM_CPU_FRQ_240M://cpu0:240m;cpu0 bus:240m
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x1,0x0,0x0,0x0);
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0 v
			sys_hal_ctrl_vdddig_h_vol(0xE);//0.95V=0.6+0.025*0xE
			break;
		case PM_CPU_FRQ_160M://cpu0:160m;bus:160m
			ret = sys_hal_core_bus_clock_ctrl(0x2,0x1,0x0,0x0,0x0);
			sys_hal_set_ram_low_speed();
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0v
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V
			break;
		case PM_CPU_FRQ_120M://cpu0:120m;bus:120m
			#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x1,0x0,0x0,0x0);
			#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x3,0x0,0x0,0x0);
			#endif
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V

			break;
		case PM_CPU_FRQ_80M://cpu0:80m;bus:80m
			#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x2,0x0,0x0,0x0);
			#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x5,0x0,0x0,0x0);
			#endif
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0x9);//0.825V

			break;
		case PM_CPU_FRQ_60M://cpu0:60m;bus:60m
			#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x3,0x0,0x0,0x0);
			#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x7,0x0,0x0,0x0);
			#endif
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0x9);//0.825V
			break;
		case PM_CPU_FRQ_XTAL://cpu0:26m;bus:26m
			ret = sys_hal_core_bus_clock_ctrl(0x0,0x0,0x0,0x0,0x0);
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0x9);//0.825V
			break;
		default:
			break;
	}

	return ret;
}
bk_err_t sys_hal_switch_cpu_bus_freq_low_to_high(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;
	switch(cpu_bus_freq)
	{
		case PM_CPU_FRQ_240M://cpu0:240m;bus:240m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0v
			sys_hal_ctrl_vdddig_h_vol(0xE);//0.95V=0.6+0.025*0xE
			sys_hal_set_ram_high_speed();
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x1,0x0,0x0,0x0);
			break;
		case PM_CPU_FRQ_160M://cpu0:160m;bus:160m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0v
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V
			ret = sys_hal_core_bus_clock_ctrl(0x2,0x1,0x0,0x0,0x0);
			break;
		case PM_CPU_FRQ_120M://cpu0:120m;bus:120m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0xC);//0.9V
			#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x1,0x0,0x0,0x0);
			#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x3,0x0,0x0,0x0);
			#endif
			break;
		case PM_CPU_FRQ_80M://cpu0:80m;bus:80m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0x9);//0.825V
			#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x2,0x0,0x0,0x0);
			#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x5,0x0,0x0,0x0);
			#endif
			break;
		case PM_CPU_FRQ_60M://cpu0:60m;bus:60m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0x9);//0.825V
			#if CONFIG_DCO_CLK_ENABLE
			ret = sys_hal_core_bus_clock_ctrl(0x1,0x3,0x0,0x0,0x0);
			#else
			ret = sys_hal_core_bus_clock_ctrl(0x3,0x7,0x0,0x0,0x0);
			#endif
			break;
		case PM_CPU_FRQ_XTAL://cpu0:26m;bus:26m
			sys_hal_ctrl_vddd_h_vol(0x6);// 1.0V
			sys_hal_ctrl_vdddig_h_vol(0x9);//0.825V
			ret = sys_hal_core_bus_clock_ctrl(0x0,0x0,0x0,0x1,0x1);
			break;
		default:
			break;
	}
	return ret;
}

static pm_cpu_freq_e s_pre_cpu_freq = PM_CPU_FRQ_120M;
bk_err_t sys_hal_switch_cpu_bus_freq(pm_cpu_freq_e cpu_bus_freq)
{
	bk_err_t ret = BK_OK;

	pm_cpu_freq_e prev_freq = s_pre_cpu_freq;

	if(prev_freq == cpu_bus_freq)
		return BK_OK;

	if(prev_freq > cpu_bus_freq)// eg: 480->60
	{
		sys_hal_switch_cpu_bus_freq_high_to_low(cpu_bus_freq);
	}
	else // eg: 60-480
	{
		sys_hal_switch_cpu_bus_freq_low_to_high(cpu_bus_freq);
	}
	s_pre_cpu_freq = cpu_bus_freq;
	return ret;
}

/*for low power function end*/
/*sleep feature end*/

uint32 sys_hal_get_chip_id(void)
{
	return sys_ll_get_version_id_versionid();
}

uint32 sys_hal_get_device_id(void)
{
	return sys_ll_get_device_id_deviceid();
}

void sys_hal_set_ram_sph_cfg(uint32_t value)
{
	sys_ll_set_reserver_reg0x1e_value(value);
}

void sys_hal_set_ram_tph_cfg(uint32_t value)
{
	sys_ll_set_reserver_reg0x1f_value(value);
}

void sys_hal_set_ram_spl_cfg(uint32_t value)
{
	sys_ll_set_reserver_reg0x2e_value(value);
}

