bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
void sys_hal_set_ram_tpl_cfg(uint32_t value)
{
	sys_ll_set_reserver_reg0x2f_value(value);
}


void sys_hal_set_ram_high_speed(void)
{

	/* When running at high frequency (more than half of the maximum frequency),
	 * RAM CFG parameters need to be modified. Please modify the configuration
	 * in the initialization program. This RAM parameter affects RAM speed and
	 * yield. RAM library recommends using high-speed configuration for
	 * high-speed operation and low-speed configuration for low-speed operation.
	 */
     uint32_t ram_sph_cfg = 0x0;//Default: 0x442 << 10 | 0x242;
     ram_sph_cfg = 0x441 << 10 | 0x241;
     sys_hal_set_ram_sph_cfg(0x5A << 24 | ram_sph_cfg); ///Default: Low-speed configuration
     sys_hal_set_ram_sph_cfg(0xA5 << 24 | ram_sph_cfg); ///Default: Low-speed configuration

     uint32_t ram_tph_cfg = 0x0;//Default: 0x902;
     ram_tph_cfg = 0x901;
     sys_hal_set_ram_tph_cfg(0x5A << 24 | ram_tph_cfg); ///Default: Low-speed configuration
     sys_hal_set_ram_tph_cfg(0xA5 << 24 | ram_tph_cfg); ///Default: Low-speed configuration

	 uint32_t ram_spl_cfg = 0x0;//Default: 0x444 << 10 | 0x244;
     ram_spl_cfg = 0x441 << 10 | 0x241;
     sys_hal_set_ram_spl_cfg(0x5A << 24 | ram_spl_cfg); ///Default: Low-speed configuration
     sys_hal_set_ram_spl_cfg(0xA5 << 24 | ram_spl_cfg); ///Default: Low-speed configuration

     uint32_t ram_tpl_cfg = 0x0;//Default: 0x904;
     ram_tpl_cfg = 0x901;
     sys_hal_set_ram_tpl_cfg(0x5A << 24 | ram_tpl_cfg); ///Default: Low-speed configuration
     sys_hal_set_ram_tpl_cfg(0xA5 << 24 | ram_tpl_cfg); ///Default: Low-speed configuration
}

void sys_hal_set_ram_low_speed(void)
{

	/* When running at high frequency (more than half of the maximum frequency),
	 * RAM CFG parameters need to be modified. Please modify the configuration
	 * in the initialization program. This RAM parameter affects RAM speed and
	 * yield. RAM library recommends using high-speed configuration for
	 * high-speed operation and low-speed configuration for low-speed operation.
	 */
     uint32_t ram_sph_cfg = 0x0;//Default: 0x442 << 10 | 0x242;
     ram_sph_cfg = 0x442 << 10 | 0x242;
     sys_hal_set_ram_sph_cfg(0x5A << 24 | ram_sph_cfg);
     sys_hal_set_ram_sph_cfg(0xA5 << 24 | ram_sph_cfg);

     uint32_t ram_tph_cfg = 0x0;//Default: 0x902;
     ram_tph_cfg = 0x902;
     sys_hal_set_ram_tph_cfg(0x5A << 24 | ram_tph_cfg);
     sys_hal_set_ram_tph_cfg(0xA5 << 24 | ram_tph_cfg);

	 uint32_t ram_spl_cfg = 0x0;//Default: 0x444 << 10 | 0x244;
     ram_spl_cfg = 0x444 << 10 | 0x244;
     sys_hal_set_ram_spl_cfg(0x5A << 24 | ram_spl_cfg); ///Default: Low-speed configuration
     sys_hal_set_ram_spl_cfg(0xA5 << 24 | ram_spl_cfg); ///Default: Low-speed configuration

     uint32_t ram_tpl_cfg = 0x0;//Default: 0x904;
     ram_tpl_cfg = 0x904;
     sys_hal_set_ram_tpl_cfg(0x5A << 24 | ram_tpl_cfg); ///Default: Low-speed configuration
     sys_hal_set_ram_tpl_cfg(0xA5 << 24 | ram_tpl_cfg); ///Default: Low-speed configuration
}

__IRAM_SEC int32_t sys_hal_set_int_en(uint32_t core_id, uint32_t int_num, uint32_t int_en)
{
	uint32_t reg = 0;
	uint32_t value = 0;

	switch (core_id) {
	case 0:
		reg = REG_READ(SYS_CPU0_INT_0_31_EN_ADDR + ((int_num / 32) << 2));
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		REG_WRITE(SYS_CPU0_INT_0_31_EN_ADDR + ((int_num / 32) << 2), reg);
		break;
	case 1:
		reg = REG_READ(SYS_CPU1_INT_0_31_EN_ADDR + ((int_num / 32) << 2));
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		REG_WRITE(SYS_CPU1_INT_0_31_EN_ADDR + ((int_num / 32) << 2), reg);
		break;
	case 2:
		reg = REG_READ(SYS_AHBP_REG10_ADDR + ((int_num / 32) << 2));
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		REG_WRITE(SYS_AHBP_REG10_ADDR + ((int_num / 32) << 2), reg);
		break;
	case 3:
		reg = REG_READ(SYS_AHBP_REG12_ADDR + ((int_num / 32) << 2));
		value = reg;
		if (int_en) {
			reg |= BIT(int_num % 32);
		} else {
			reg &= ~BIT(int_num % 32);
		}
		REG_WRITE(SYS_AHBP_REG12_ADDR + ((int_num / 32) << 2), reg);
		break;
	default:
		break;
	}

	return value;
}

__IRAM_SEC int32 sys_hal_int_disable(uint32_t core_index, uint32 param) //CMD_ICU_INT_DISABLE
{
	uint32 reg = 0;
	uint32 value = 0;
	if(core_index == 0)//cpu0
	{
		reg = sys_ll_get_cpu0_int_0_31_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu0_int_0_31_en_value(reg);
	}
	else
	{
		reg = sys_ll_get_cpu1_int_0_31_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu1_int_0_31_en_value(reg);
	}
	return value;
}

__IRAM_SEC int32 sys_hal_int_enable(uint32_t core_index,uint32 param) //CMD_ICU_INT_ENABLE
{
	uint32 reg = 0;
	if(core_index == 0)//cpu0
	{
		reg = sys_ll_get_cpu0_int_0_31_en_value();
		reg |= (param);
		sys_ll_set_cpu0_int_0_31_en_value(reg);
	}
	else
	{
		reg = sys_ll_get_cpu1_int_0_31_en_value();
		reg |= (param);
		sys_ll_set_cpu1_int_0_31_en_value(reg);
	}
	return 0;
}

__IRAM_SEC int32 sys_hal_int_group2_disable(uint32_t core_index,uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;
	if(core_index == 0)//cpu0
	{
		reg = sys_ll_get_cpu0_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu0_int_32_63_en_value(reg);
	}
	else
	{
		reg = sys_ll_get_cpu1_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu1_int_32_63_en_value(reg);
	}
	return value;
}

__IRAM_SEC int32 sys_hal_int_group2_enable(uint32_t core_index,uint32 param)
{
	uint32 reg = 0;
	if(core_index == 0)//cpu0
	{
		reg = sys_ll_get_cpu0_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu0_int_32_63_en_value(reg);
	}
	else
	{
		reg = sys_ll_get_cpu1_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu1_int_32_63_en_value(reg);
	}
	return 0;
}

int32 sys_hal_core_int_group1_disable(uint32_t core_id, uint32 param)
{
	return 0;
}

int32 sys_hal_core_int_group1_enable(uint32_t core_id, uint32 param)
{
	return 0;
}

int32 sys_hal_core_int_group2_disable(uint32_t core_id, uint32 param)
{
	return 0;
}

int32 sys_hal_core_int_group2_enable(uint32_t core_id, uint32 param)
{
	return 0;
}

