bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
int32 sys_hal_fiq_disable(uint32_t core_index,uint32 param)
{
	return 0;
}

int32 sys_hal_fiq_enable(uint32_t core_index,uint32 param)
{
	return 0;
}

int32 sys_hal_global_int_disable(uint32 param)
{
	return 0;
}

int32 sys_hal_global_int_enable(uint32 param)
{
	return 0;
}

uint32 sys_hal_get_int_status(uint32_t core_index)
{
	uint32_t ret = 0;

	if(core_index == 0) {
		ret = sys_ll_get_cpu0_int_0_31_status_value();
	} else if(core_index == 1) {
		ret = sys_ll_get_cpu1_int_0_31_status_value();
	}

	return ret;
}

__attribute__((section(".iram"))) uint32 sys_hal_get_int_group2_status(uint32_t core_index)
{
	uint32_t ret = 0;

	if(core_index == 0) {
		ret = sys_ll_get_cpu0_int_32_63_status_value();
	} else if(core_index == 1) {
		ret = sys_ll_get_cpu1_int_32_63_status_value();
	}

	return ret;
}

uint32_t sys_hal_get_cpu0_gpio_int_st(void)
{
	return 0;
}

int32 sys_hal_set_int_status(uint32 param)
{
	return 0;
}

uint32 sys_hal_get_fiq_reg_status(uint32_t core_index)
{
	return 0;
}

uint32 sys_hal_set_fiq_reg_status(uint32 param)
{
	return 0;
}

uint32 sys_hal_get_intr_raw_status(void)
{
	return 0;
}

uint32 sys_hal_set_intr_raw_status(uint32 param)
{
	return 0;
}

int32 sys_hal_set_jtag_mode(uint32 param)
{
	return 0;
}

uint32 sys_hal_get_jtag_mode(void)
{
	return 0;
}

bk_err_t sys_hal_wireless_clock_ctrl(dev_clk_pwr_id_t dev, dev_clk_pwr_ctrl_t power_up)
{
	uint32_t dev_pos = 0;
	if((dev == CLK_PWR_ID_XVR) || (dev == CLK_PWR_ID_MAC) || (dev == CLK_PWR_ID_PHY) || (dev == CLK_PWR_ID_RF) || (dev == CLK_PWR_ID_THREAD))
	{
		dev_pos = dev%PM_CLOCK_MODE_1_POS;
		if(power_up == CLK_PWR_CTRL_PWR_UP)
		{
			if(s_pm_wireless_clock_state == 0x0)
			{
				if(sys_ll_get_reserver_reg0xd_wlss_cken() == 0x0)
				{
					sys_ll_set_reserver_reg0xd_wlss_cken(0x1);
				}
			}
			s_pm_wireless_clock_state |= (0x1 << dev_pos);
		}
		else
		{
			if(s_pm_wireless_clock_state &(0x1 << dev_pos))
			{
				s_pm_wireless_clock_state &= ~(0x1 << dev_pos);
				if (0x0 == s_pm_wireless_clock_state) {
					sys_ll_set_reserver_reg0xd_wlss_cken(0x0);
				}
			}
		}
	}
	return BK_OK;
}
__IRAM_SEC void sys_hal_clk_pwr_ctrl(dev_clk_pwr_id_t dev, dev_clk_pwr_ctrl_t power_up)
{
	uint32_t reg_val = 0;

	sys_hal_wireless_clock_ctrl(dev, power_up);

	if (dev < PM_CLOCK_MODE_1_POS) {
		reg_val = sys_ll_get_cpu_device_clk_enable_value();
		if (power_up == CLK_PWR_CTRL_PWR_UP) {
			reg_val |= BIT(dev);
		} else {
			reg_val &= ~BIT(dev);
		}
		sys_ll_set_cpu_device_clk_enable_value(reg_val);
	} else if (dev < PM_CLOCK_MODE_2_POS) {
		reg_val = sys_ll_get_reserver_reg0xd_value();
		if (power_up == CLK_PWR_CTRL_PWR_UP) {
			reg_val |= BIT(dev - PM_CLOCK_MODE_1_POS);
		} else {
			reg_val &= ~BIT(dev - PM_CLOCK_MODE_1_POS);
		}
		sys_ll_set_reserver_reg0xd_value(reg_val);
	} else {
		reg_val = sys_ahbp_ll_get_rega_value();
		if (power_up == CLK_PWR_CTRL_PWR_UP) {
			reg_val |= BIT(dev - PM_CLOCK_MODE_2_POS);
		} else {
			reg_val &= ~BIT(dev - PM_CLOCK_MODE_2_POS);
		}
		sys_ahbp_ll_set_rega_value(reg_val);
	}
}

uint32_t sys_hal_clk_pwr_status_get(dev_clk_pwr_id_t dev)
{
	if (dev < PM_CLOCK_MODE_1_POS) {
		return sys_ll_get_cpu_device_clk_enable_value();
	} else if (dev < PM_CLOCK_MODE_2_POS) {
		return sys_ll_get_reserver_reg0xd_value();
	} else {
		return sys_ahbp_ll_get_rega_value();
	}
}

uint32_t sys_hal_clk_pwr_is_enabled(dev_clk_pwr_id_t dev)
{
	uint32_t reg_val = sys_hal_clk_pwr_status_get(dev);

	if (dev < PM_CLOCK_MODE_1_POS) {
		return (reg_val >> dev) & 0x1;
	} else if (dev < PM_CLOCK_MODE_2_POS) {
		return (reg_val >> (dev - PM_CLOCK_MODE_1_POS)) & 0x1;
	} else {
		return (reg_val >> (dev - PM_CLOCK_MODE_2_POS)) & 0x1;
	}
}

void sys_hal_set_cpu_power_sleep_wakeup_pwd_ofdm(uint32_t v)
{
#if (CONFIG_SOC_BK7236XX || CONFIG_SOC_BK7239XX)
	sys_ll_set_cpu_power_sleep_wakeup_pwd_ofdm(v);
#else
	(void)v;
#endif
}

uint32_t sys_hal_get_cpu_power_sleep_wakeup_pwd_ofdm(void)
{
#if (CONFIG_SOC_BK7236XX || CONFIG_SOC_BK7239XX)
	return sys_ll_get_cpu_power_sleep_wakeup_pwd_ofdm();
#elif CONFIG_SOC_BK7259
#if 1 //workaround
	bool get_dsss_only_flag(void);
	return get_dsss_only_flag();
#else//platform wakeup failure,to Do...
	return (0 == sys_ll_get_reserver_reg0xd_ofdm_cken());
#endif
#else
	return 0;
#endif
}

void sys_hal_uart_select_clock(uart_id_t id, uart_src_clk_t mode)
{
	int sel_xtal = 0;
	int sel_apll = 1;

	switch(id)
	{
		case UART_ID_0:
		{
			if(mode == UART_SCLK_APLL)
				sys_ll_set_cpu_clk_div_mode2_cksel_uart0(sel_apll);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_uart0(sel_xtal);
			break;
		}
		case UART_ID_1:
		{
			if(mode == UART_SCLK_APLL)
				sys_ll_set_cpu_clk_div_mode2_cksel_uart1(sel_apll);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_uart1(sel_xtal);
			break;
		}
		case UART_ID_2:
		{
			if(mode == UART_SCLK_APLL)
				sys_ll_set_cpu_clk_div_mode2_cksel_uart2(sel_apll);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_uart2(sel_xtal);
			break;
		}
		case UART_ID_3:
		{
			if(mode == UART_SCLK_APLL)
				sys_ll_set_cpu_clk_div_mode2_cksel_uart3(sel_apll);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_uart3(sel_xtal);
			break;
		}
		case UART_ID_4:
		{
			if(mode == UART_SCLK_APLL)
				sys_ll_set_cpu_clk_div_mode2_cksel_uart4(sel_apll);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_uart4(sel_xtal);
			break;
		}
		default:
			break;
	}
}

void sys_hal_i2c_select_clock(i2c_id_t id, i2c_src_clk_t mode)
{
	int sel_xtal = 0;
	int sel_80m = 1;

	switch(id)
	{
		case I2C_ID_0:
		{
			if(mode == I2C_SCLK_80M)
				sys_ll_set_cpu_clk_div_mode2_cksel_i2c0(sel_80m);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_i2c0(sel_xtal);
			break;
		}
#if (SOC_I2C_UNIT_NUM > 1)
		case I2C_ID_1:
		{
			// I2C_ID_1 may not have separate clock select in sys_ll
			break;
		}
#endif
		default:
			break;
	}
}

void sys_hal_pwm_set_clock(uint32_t mode, uint32_t param)
{
	// TODO: Implement based on mode and param
	return;
}

void sys_hal_pwm_select_clock(sys_sel_pwm_t num, pwm_src_clk_t mode)
{
	int sel_clk32 = 0;
	int sel_xtal = 1;

	switch(num)
	{
		case SYS_SEL_PWM0:
			if(mode == PWM_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode3_cksel_pwm0(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode3_cksel_pwm0(sel_clk32);
			break;
		default:
			break;
	}
}

void sys_hal_timer_select_clock(sys_sel_timer_t num, timer_src_clk_t mode)
{
	int sel_clk32 = 0;
	int sel_xtal = 1;

	switch(num)
	{
		case SYS_SEL_TIMER0:
			if(mode == TIMER_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode2_cksel_tim0(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_tim0(sel_clk32);
			break;
		case SYS_SEL_TIMER1:
			if(mode == TIMER_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode2_cksel_tim1(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_tim1(sel_clk32);
			break;

		default:
			break;
	}
}

uint32_t sys_hal_timer_select_clock_get(sys_sel_timer_t id)
{
    uint32_t ret = 0;

