bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
    switch(id)
    {
        case SYS_SEL_TIMER0:
        {
            ret = sys_ll_get_cpu_clk_div_mode2_cksel_tim0();
            break;
        }
        case SYS_SEL_TIMER1:
        {
            ret = sys_ll_get_cpu_clk_div_mode2_cksel_tim1();
            break;
        }
        default:
            break;
    }

    ret = (ret)?TIMER_SCLK_XTAL:TIMER_SCLK_CLK32;

    return ret;
}

void sys_hal_spi_select_clock(spi_id_t num, spi_src_clk_t mode)
{
	int sel_xtal = 0;
	int sel_160m = 1;

	switch(num)
	{
		case SPI_ID_0:
			if(mode == SPI_CLK_XTAL)
				sys_ll_set_cpu_clk_div_mode2_cksel_spi0(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_spi0(sel_160m);
			break;
#if (SOC_SPI_UNIT_NUM > 1)
		case SPI_ID_1:
			if(mode == SPI_CLK_XTAL)
				sys_ll_set_cpu_clk_div_mode2_cksel_spi1(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_spi1(sel_160m);
			break;
#endif
#if (SOC_SPI_UNIT_NUM > 2)
		case SPI_ID_2:
			if(mode == SPI_CLK_XTAL)
				sys_ll_set_cpu_clk_div_mode2_cksel_spi2(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_spi2(sel_160m);
			break;
#endif
#if (SOC_SPI_UNIT_NUM > 3)
		case SPI_ID_3:
			if(mode == SPI_CLK_XTAL)
				sys_ll_set_cpu_clk_div_mode2_cksel_spi3(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode2_cksel_spi3(sel_160m);
			break;
#endif
		default:
			break;
	}
}

void sys_hal_set_qspi_vddram_voltage(uint32_t param)
{
	// TODO: Implement QSPI VDD RAM voltage control
	return;
}

void sys_hal_set_qspi_io_voltage(uint32_t param)
{
	// TODO: Implement QSPI IO voltage control
	return;
}

void sys_hal_qspi_clk_sel(uint32_t id, uint32_t param)
{
	// TODO: Implement QSPI clock selection
	return;
}

void sys_hal_qspi_set_src_clk_div(uint32_t id, uint32_t value)
{
	// TODO: Implement QSPI clock divider
	return;
}

#if 1	//tmp build
void sys_hal_set_clk_select(dev_clk_select_id_t dev, dev_clk_select_t clk_sel)
{
	return;
}
dev_clk_select_t sys_hal_get_clk_select(dev_clk_select_id_t dev)
{
	return 0;
}
//DCO divider is valid for all of the peri-devices.
void sys_hal_set_dco_div(dev_clk_dco_div_t div)
{
	return;
}
//DCO divider is valid for all of the peri-devices.
dev_clk_dco_div_t sys_hal_get_dco_div(void)
{
	return CLK_DCO_DIV_1;
}
#endif	//temp build
/*clock power control end*/
void sys_hal_set_cksel_sadc(uint32_t value)
{
    sys_ll_set_cpu_clk_div_mode2_cksel_sadc(value);
}
void sys_hal_set_cksel_pwm0(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode3_cksel_pwm0(value);
}

void sys_hal_set_cksel_pwm1(uint32_t value)
{
	// Not supported in BK7259
	return;
}

void sys_hal_set_cksel_pwm(uint32_t value)
{
	sys_hal_set_cksel_pwm0(value);
}
uint32_t sys_hal_uart_select_clock_get(uart_id_t id)
{
	uint32_t ret = 0;

	switch(id)
	{
		case UART_ID_0:
		{
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_uart0();
			break;
		}
		case UART_ID_1:
		{
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_uart1();
			break;
		}
		case UART_ID_2:
		{
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_uart2();
			break;
		}
		case UART_ID_3:
		{
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_uart3();
			break;
		}
		case UART_ID_4:
		{
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_uart4();
			break;
		}
		default:
			break;
	}

	ret = (!ret)?UART_SCLK_XTAL_26M:UART_SCLK_APLL;

	return ret;
}
uint32_t sys_hal_i2c_select_clock_get(i2c_id_t id)
{
	uint32_t ret = 0;

	switch(id)
	{
		case I2C_ID_0:
		{
			ret = sys_ll_get_cpu_clk_div_mode2_cksel_i2c0();
			break;
		}
#if (SOC_I2C_UNIT_NUM > 1)
		case I2C_ID_1:
		{
			// I2C_ID_1 may not have separate clock select in sys_ll
			ret = I2C_SCLK_XTAL;
			break;
		}
#endif
		default:
			break;
	}

	ret = (!ret)?I2C_SCLK_XTAL:I2C_SCLK_80M;

	return ret;
}
void sys_hal_sadc_int_enable(void)
{
	sys_hal_int_enable(rtos_get_core_id(),SADC_INTERRUPT_CTRL_BIT);
}
void sys_hal_sadc_int_disable(void)
{
	sys_hal_int_disable(rtos_get_core_id(),SADC_INTERRUPT_CTRL_BIT);
}
void sys_hal_sadc_pwr_up(void)
{
	sys_ll_set_cpu_device_clk_enable_sadc_cken(1);
	sys_ll_set_ana_reg22_gadc_en_spi(1);
}
void sys_hal_sadc_pwr_down(void)
{
	sys_ll_set_ana_reg22_gadc_en_spi(0);
	sys_ll_set_cpu_device_clk_enable_sadc_cken(0);
}

void sys_hal_set_saradc_cali_config(void)
{
    sys_ll_set_ana_reg22_value(0x3CAA5241);
    sys_ll_set_ana_reg23_value(0x33);
    sys_ll_set_ana_reg24_value(0x33);
    sys_ll_set_ana_reg2_adcdcsel(0x0);
}

void sys_hal_set_saradc_config(void)
{
    /* ana_reg0x22 */
    uint32_t reg_val = sys_ll_get_ana_reg22_value();
    reg_val |= BIT(31);
    reg_val &= ~BIT(30);
    reg_val &= ~BIT(25);
    sys_ll_set_ana_reg22_value(reg_val);
}

void sys_hal_set_sdmadc_config(void)
{
	// TODO: Implement SDMADC configuration
	return;
}

/** GADC Config (ana_reg22) Start **/

void sys_hal_set_gadc_config(uint32_t value)
{
	sys_ll_set_ana_reg22_value(value);
}

uint32_t sys_hal_get_gadc_config(void)
{
	return sys_ll_get_ana_reg22_value();
}

void sys_hal_set_gadc_enable(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_en_spi(value);
}

uint32_t sys_hal_get_gadc_enable(void)
{
	return sys_ll_get_ana_reg22_gadc_en_spi();
}

void sys_hal_set_gadc_inbuf_enable(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_inbuf_en(value);
}

uint32_t sys_hal_get_gadc_inbuf_enable(void)
{
	return sys_ll_get_ana_reg22_gadc_inbuf_en();
}

void sys_hal_set_gadc_calcap_ch(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_calcap_ch(value);
}

uint32_t sys_hal_get_gadc_calcap_ch(void)
{
	return sys_ll_get_ana_reg22_gadc_calcap_ch();
}

void sys_hal_set_gadc_clk_inv(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_clk_in(value);
}

uint32_t sys_hal_get_gadc_clk_inv(void)
{
	return sys_ll_get_ana_reg22_gadc_clk_in();
}

void sys_hal_set_gadc_clk_sel(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_clk_sel(value);
}

uint32_t sys_hal_get_gadc_clk_sel(void)
{
	return sys_ll_get_ana_reg22_gadc_clk_sel();
}

void sys_hal_set_gadc_cal_ramp_enable(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_calintsaw_en(value);
}

uint32_t sys_hal_get_gadc_cal_ramp_enable(void)
{
	return sys_ll_get_ana_reg22_gadc_calintsaw_en();
}

void sys_hal_set_gadc_clk_relatch(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_clk_rlten(value);
}

