bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
uint32_t sys_hal_get_gadc_clk_relatch(void)
{
	return sys_ll_get_ana_reg22_gadc_clk_rlten();
}

void sys_hal_set_gadc_vbg_sel(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_vbg_sel(value);
}

uint32_t sys_hal_get_gadc_vbg_sel(void)
{
	return sys_ll_get_ana_reg22_gadc_vbg_sel();
}

void sys_hal_set_gadc_comp_isel(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_comp_isel(value);
}

uint32_t sys_hal_get_gadc_comp_isel(void)
{
	return sys_ll_get_ana_reg22_gadc_comp_isel();
}

void sys_hal_set_gadc_preamp_isel(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_preamp_isel(value);
}

uint32_t sys_hal_get_gadc_preamp_isel(void)
{
	return sys_ll_get_ana_reg22_gadc_preamp_isel();
}

void sys_hal_set_gadc_bufamp_isel(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_bufamp_isel(value);
}

uint32_t sys_hal_get_gadc_bufamp_isel(void)
{
	return sys_ll_get_ana_reg22_gadc_bufamp_isel();
}

void sys_hal_set_gadc_vref_sel(uint32_t value)
{
	sys_ll_set_ana_reg22_gadc_vref_sel(value);
}

uint32_t sys_hal_get_gadc_vref_sel(void)
{
	return sys_ll_get_ana_reg22_gadc_vref_sel();
}

void sys_hal_set_gadc_inbuf_isel(uint32_t value)
{
	sys_ll_set_ana_reg22_inbuffer_isel(value);
}

uint32_t sys_hal_get_gadc_inbuf_isel(void)
{
	return sys_ll_get_ana_reg22_inbuffer_isel();
}

/** GADC Config (ana_reg22) End **/

/** Audio Bias & Mic Control (ana_reg20/ana_reg27) Start **/

void sys_hal_set_micbias_enable(uint32_t value)
{
	sys_ll_set_ana_reg20_enmicbias(value);
}

void sys_hal_set_mic2_enable(uint32_t value)
{
	sys_ll_set_ana_reg27_micen_mic2(value);
}

/** Audio Bias & Mic Control (ana_reg20/ana_reg27) End **/

/** VAD Control (ana_reg23) Start **/

void sys_hal_set_vad_config(uint32_t value)
{
	sys_ll_set_ana_reg23_value(value);
}

uint32_t sys_hal_get_vad_config(void)
{
	return sys_ll_get_ana_reg23_value();
}

void sys_hal_set_vad_enable(uint32_t value)
{
	sys_ll_set_ana_reg23_vad_en(value);
}

uint32_t sys_hal_get_vad_enable(void)
{
	return sys_ll_get_ana_reg23_vad_en();
}

void sys_hal_set_vad_cftrm(uint32_t value)
{
	sys_ll_set_ana_reg23_vad_cftrm(value);
}

uint32_t sys_hal_get_vad_cftrm(void)
{
	return sys_ll_get_ana_reg23_vad_cftrm();
}

void sys_hal_set_vad_cstrm(uint32_t value)
{
	sys_ll_set_ana_reg23_vad_cstrm(value);
}

uint32_t sys_hal_get_vad_cstrm(void)
{
	return sys_ll_get_ana_reg23_vad_cstrm();
}

void sys_hal_set_vad_viniset(uint32_t value)
{
	sys_ll_set_ana_reg23_vad_viniset(value);
}

uint32_t sys_hal_get_vad_viniset(void)
{
	return sys_ll_get_ana_reg23_vad_viniset();
}

void sys_hal_set_vad_rstn(uint32_t value)
{
	sys_ll_set_ana_reg23_vad_rstn(value);
}

uint32_t sys_hal_get_vad_rstn(void)
{
	return sys_ll_get_ana_reg23_vad_rstn();
}

void sys_hal_set_vad_vcm_sel(uint32_t value)
{
	sys_ll_set_ana_reg23_vadrefsel(value);
}

uint32_t sys_hal_get_vad_vcm_sel(void)
{
	return sys_ll_get_ana_reg23_vadrefsel();
}

void sys_hal_set_vad_clk_inv(uint32_t value)
{
	sys_ll_set_ana_reg23_vadckinven(value);
}

uint32_t sys_hal_get_vad_clk_inv(void)
{
	return sys_ll_get_ana_reg23_vadckinven();
}

/** VAD Control (ana_reg23) End **/

/** Power/LDO Control (ana_reg10/0x4a) Start **/

void sys_hal_set_core_ldo_low_vol(uint32_t value)
{
	sys_ll_set_ana_reg10_vcorelsel(value);
}

uint32_t sys_hal_get_core_ldo_low_vol(void)
{
	return sys_ll_get_ana_reg10_vcorelsel();
}

void sys_hal_set_core_ldo_high_vol(uint32_t value)
{
	sys_ll_set_ana_reg10_vcorehsel(value);
}

uint32_t sys_hal_get_core_ldo_high_vol(void)
{
	return sys_ll_get_ana_reg10_vcorehsel();
}

void sys_hal_set_digldo_low_vol_enable(uint32_t value)
{
	sys_ll_set_ana_reg10_vdd12lden(value);
}

void sys_hal_set_coreldo_low_vol_enable(uint32_t value)
{
	sys_ll_set_ana_reg10_vlden(value);
}

/** Power/LDO Control (ana_reg10/0x4a) End **/

/** LDO HP Mode & RTC Clock (ana_reg9/0x49) Start **/

void sys_hal_set_aloldo_hp(uint32_t value)
{
	sys_ll_set_ana_reg9_aloldohp(value);
}

void sys_hal_set_analdo_hp(uint32_t value)
{
	sys_ll_set_ana_reg9_aldohp(value);
}

void sys_hal_set_digldo_hp(uint32_t value)
{
	sys_ll_set_ana_reg9_dldohp(value);
}

void sys_hal_set_coreldo_hp(uint32_t value)
{
	sys_ll_set_ana_reg9_coreldo_hp(value);
}

void sys_hal_set_rtc_clk_sel(uint32_t value)
{
	sys_ll_set_ana_reg9_clk_sel(value);
}

void sys_hal_set_aon_ldo_vol(uint32_t value)
{
	sys_ll_set_ana_reg9_valoldosel(value);
}

/** LDO HP Mode & RTC Clock (ana_reg9/0x49) End **/

/** BuckA Control (ana_reg12/0x4c) Start **/

void sys_hal_set_bucka_ea_enable(uint32_t value)
{
	sys_ll_set_ana_reg12_enpowa(value);
}

/** BuckA Control (ana_reg12/0x4c) End **/

/** Analog Clock Control (ana_reg5/0x45) Start **/

void sys_hal_set_dpll_enable(uint32_t value)
{
	sys_ll_set_ana_reg5_en_dpll(value);
}

void sys_hal_set_dco_enable(uint32_t value)
{
	sys_ll_set_ana_reg5_en_dco(value);
}

void sys_hal_set_xtall_enable(uint32_t value)
{
	sys_ll_set_ana_reg5_en_xtall(value);
}

void sys_hal_set_cb_enable(uint32_t value)
{
	sys_ll_set_ana_reg5_en_cb(value);
}

/** Analog Clock Control (ana_reg5/0x45) End **/

void sys_hal_set_clksel_spi0(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_spi0(value);
}

void sys_hal_set_clksel_spi1(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_spi1(value);
}

void sys_hal_set_clksel_spi(uint32_t value)
{
	if((SPI_CLK_SRC_XTAL == value) || (SPI_CLK_SRC_APLL == value))
	{
		sys_ll_set_cpu_clk_div_mode2_cksel_spi0(value);
#if (SOC_SPI_UNIT_NUM > 1)
		sys_ll_set_cpu_clk_div_mode2_cksel_spi1(value);
#endif
#if (SOC_SPI_UNIT_NUM > 2)
		sys_ll_set_cpu_clk_div_mode2_cksel_spi2(value);
#endif
#if (SOC_SPI_UNIT_NUM > 3)
		sys_ll_set_cpu_clk_div_mode2_cksel_spi3(value);
#endif
	}
}


void sys_hal_trng_disckg_set(uint32_t value)
{
	// TODO: Implement TRNG disckg setting
	return;
}

uint32_t sys_hal_interrupt_status_get(void)
{
	return sys_hal_get_int_status(rtos_get_core_id());
}

void sys_hal_interrupt_status_set(uint32_t value)
{
	// Status register is read-only, this function may not be needed
	return;
}

void sys_hal_en_tempdet(uint32_t value)
{
	sys_ll_set_ana_reg5_en_temp(value);
}
uint32_t sys_hal_mclk_mux_get(void)
{
	uint32_t ret = 0;

	ret = sys_ll_get_cpu_clk_div_mode1_cksel_core();

	return ret;
}

void sys_hal_mclk_mux_set(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_cksel_core(value);
}

uint32_t sys_hal_mclk_div_get(void)
{
	uint32_t ret = 0;

	ret = sys_ll_get_cpu_clk_div_mode1_ckdiv_core();

	return ret;
}

