bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
void sys_hal_mclk_div_set(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_ckdiv_core(value);
}

void sys_hal_mclk_select(uint32_t value)
{
	sys_hal_mclk_mux_set(value);
}
/**  Platform End **/
/**  BT Start **/
//BT
void sys_hal_bt_power_ctrl(bool power_up)
{
	return;
}

void sys_hal_bt_clock_ctrl(bool en)
{
	return;
}

void sys_hal_xvr_clock_ctrl(bool en)
{
	return;
}

void sys_hal_btdm_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_dm_irq_int_en(1);
            //TODO enable PLIC Int Enable Registers
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_dm_irq_int_en(0);
            //TODO disable PLIC Int Enable Registers
    }
}

void sys_hal_ble_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ble_irq_int_en(1);
            //TODO enable PLIC Int Enable Registers
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ble_irq_int_en(0);
            //TODO disable PLIC Int Enable Registers
    }
}

void sys_hal_bt_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_bt_irq_int_en(1);
            //TODO enable PLIC Int Enable Registers
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_bt_irq_int_en(0);
            //TODO disable PLIC Int Enable Registers
    }
}

#if CONFIG_MAC802154_ENABLE
extern int32_t sys_drv_set_int_en(uint32_t core_id, uint32_t int_num, uint32_t int_en);
void sys_hal_thread_interrupt_ctrl(bool en)
{
    if (en) {
		sys_drv_set_int_en(CPU0_CORE_ID, INT_SRC_THREAD, 1);
    } else {
		sys_drv_set_int_en(CPU0_CORE_ID, INT_SRC_THREAD, 0);
    }
}
#endif

void sys_hal_bt_rf_ctrl(bool en)
{
	return;
}

void sys_hal_rf_ctrl(uint8_t type)
{
    if (type == RF_CTRL_PTA) {
        // rf ctrl by PTA
        sys_ll_set_cpu_storage_connect_op_select_rf_switch_manual_en(0);
    } else if (type == RF_CTRL_WIFI) {
        // rf ctrl by Wi-Fi
        sys_ll_set_cpu_storage_connect_op_select_rf_switch_manual_en(1);
        sys_ll_set_cpu_storage_connect_op_select_rf_source(RF_CTRL_WIFI);
    } else if (type == RF_CTRL_BT) {
        // rf ctrl by BT
        sys_ll_set_cpu_storage_connect_op_select_rf_switch_manual_en(1);
        sys_ll_set_cpu_storage_connect_op_select_rf_source(RF_CTRL_BT);
    } else if (type == RF_CTRL_THREAD) {
        // rf ctrl by thread
       sys_ll_set_cpu_storage_connect_op_select_rf_switch_manual_en(1);
       sys_ll_set_cpu_storage_connect_op_select_rf_source(RF_CTRL_THREAD);
    }
}

uint8_t sys_hal_rf_ctrl_type_get(void)
{
    uint8_t type = 0;
    if (sys_ll_get_cpu_storage_connect_op_select_rf_switch_manual_en()) {
        type = sys_ll_get_cpu_storage_connect_op_select_rf_source();
        if (type == RF_CTRL_PTA || type == RF_CTRL_WIFI) {
            type = RF_CTRL_WIFI;
        }
    } else {
        type = RF_CTRL_PTA;
    }

    return type;
}

uint32_t sys_hal_bt_rf_status_get(void)
{
	return 0;
}
void sys_hal_bt_sleep_exit_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu_power_sleep_wakeup_bts_soft_wakeup_req(1);
    }
    else
    {
        sys_ll_set_cpu_power_sleep_wakeup_bts_soft_wakeup_req(0);
    }
}

void sys_hal_set_bts_wakeup_platform_en(bool value)
{
	return;
}
uint32 sys_hal_get_bts_wakeup_platform_en()
{
	return 0;
}
/**  BT End **/
/**  Audio Start **/
//Audio
/**  Audio End **/
/**  Video Start **/
/**  Video End **/
/**  WIFI Start **/
//WIFI
//Yantao Add Start
void sys_hal_modem_core_reset(void)
{
	return;
}
void sys_hal_mpif_invert(void)
{
	return;
}
void sys_hal_modem_subsys_reset(void)
{
	return;
}
void sys_hal_mac_subsys_reset(void)
{
	return;
}
void sys_hal_usb_subsys_reset(void)
{
	return;
}
void sys_hal_dsp_subsys_reset(void)
{
	return;
}
void sys_hal_mac_power_ctrl(bool power_up)
{
	return;
}
void sys_hal_modem_power_ctrl(bool power_up)
{
	return;
}
void sys_hal_pta_ctrl(bool pta_en)
{
	return;
}
__IRAM_SEC void sys_hal_modem_bus_clk_ctrl(bool clk_en)
{
	return;
}
__IRAM_SEC void sys_hal_modem_clk_ctrl(bool clk_en)
{
	sys_ll_set_reserver_reg0xd_phy_cken(clk_en);
}
void sys_hal_mac_bus_clk_ctrl(bool clk_en)
{
	return;
}
void sys_hal_mac_clk_ctrl(bool clk_en)
{
	sys_ll_set_reserver_reg0xd_mac_cken(clk_en);
}

uint32_t sys_hal_wifi_wlss_clk_is_enabled(void)
{
	return sys_ll_get_reserver_reg0xd_wlss_cken();
}

uint32_t sys_hal_wifi_mac_clk_is_enabled(void)
{
	return sys_ll_get_reserver_reg0xd_mac_cken();
}

uint32_t sys_hal_wifi_phy_clk_is_enabled(void)
{
	return sys_ll_get_reserver_reg0xd_phy_cken();
}

void sys_hal_wifi_reg_access_status_get(uint32_t *clk_status, uint32_t *power_status)
{
	if (clk_status) {
		*clk_status = sys_ll_get_reserver_reg0xd_value();
	}

	if (power_status) {
		*power_status = sys_ll_get_reserver_reg0x10_value();
	}
}

void sys_hal_set_vdd_value(uint32_t param)
{
	sys_hal_ctrl_vdddig_h_vol(param);
}
uint32_t sys_hal_get_vdd_value(void)
{
	return sys_ll_get_ana_reg10_vcorehsel();
}
//CMD_SCTRL_BLOCK_EN_MUX_SET
void sys_hal_block_en_mux_set(uint32_t param)
{
	return;
}
void sys_hal_enable_mac_gen_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_gen_n_int_en(1);
	return;
}
void sys_hal_enable_mac_prot_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_port_trigger_n_int_en(1);
	return;
}
void sys_hal_enable_mac_tx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_trigger_n_int_en(1);
	return;
}
void sys_hal_enable_mac_rx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_rx_trigger_n_int_en(1);
	return;
}
void sys_hal_enable_mac_txrx_misc_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_rx_misc_n_int_en(1);
	return;
}
void sys_hal_enable_mac_txrx_timer_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_mac_int_tx_rx_timer_n_int_en(1);
	return;
}
void sys_hal_enable_modem_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_phy_mbp_int_en(1);
}
void sys_hal_enable_modem_rc_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_phy_riu_int_en(1);
}
void sys_hal_enable_hsu_int(void)
{
	return;
}
void sys_hal_disable_hsu_int(void)
{
	return;
}
void sys_hal_set_debug_mux(int type)
{
	return;
}
void sys_hal_diag_debug_mac()
{
	return;
}
void sys_hal_diag_debug_phy()
{
	return;
}
void dbg_enable_debug_gpio(void)
{
	return;
}

__IRAM_SEC void sys_hal_rf_clk_ctrl(bool clk_en)
{
	sys_ll_set_reserver_reg0xd_rf_cken(clk_en);
}
//Yantao Add End
void sys_hal_cali_dpll_spi_trig_disable(void)
{
	sys_ll_set_ana_reg0_spitrig(0);
}

void sys_hal_cali_dpll_spi_trig_enable(void)
{
	sys_ll_set_ana_reg0_spitrig(1);
}

void sys_hal_cali_dpll_spi_detect_disable(void)
{
	sys_ll_set_ana_reg0_spideten(0);
}

void sys_hal_cali_dpll_spi_detect_enable(void)
{
	sys_ll_set_ana_reg0_spideten(1);
}
void sys_hal_set_xtalh_ctune(uint32_t value)
{
	sys_ll_set_ana_reg3_ctune(value);
	return;
}
__attribute__((section(".iram"))) void sys_hal_analog_set(analog_reg_t reg, uint32_t value)
{
	uint32_t analog_reg_address;

