bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
	if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
		return;
	}

	analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	sys_ll_set_analog_reg_value(analog_reg_address, value);
}

uint32_t sys_hal_analog_get(analog_reg_t reg)
{
	uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return 0;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	return sys_ll_get_analog_reg_value(analog_reg_address);
}

void sys_hal_set_ana_reg1_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg2_value(uint32_t value)
{
	return;
}
uint32_t sys_hal_get_ana_reg2_value(void)
{
	return sys_ll_get_ana_reg2_value();
}
void sys_hal_set_ana_reg3_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg4_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg12_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg13_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg14_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg15_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg16_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg17_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg18_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg19_value(uint32_t value)
{
	return;
}
void sys_hal_set_ana_reg20_value(uint32_t value)
{
    sys_ll_set_ana_reg20_value(value);
}
uint32_t sys_hal_get_ana_reg20_value(void)
{
    return sys_ll_get_ana_reg20_value();
}
void sys_hal_set_ana_reg21_value(uint32_t value)
{
    sys_ll_set_ana_reg21_value(value);
}
void sys_hal_set_ana_reg24_value(uint32_t value)
{
    sys_ll_set_ana_reg24_value(value);
}
uint32_t sys_hal_get_ana_reg24_value(void)
{
    return sys_ll_get_ana_reg24_value();
}
void sys_hal_set_ana_reg25_value(uint32_t value)
{
    sys_ll_set_ana_reg25_value(value);
}
void sys_hal_set_ana_reg27_value(uint32_t value)
{
    sys_ll_set_ana_reg27_value(value);
}
uint32_t sys_hal_get_ana_reg27_value(void)
{
    return sys_ll_get_ana_reg27_value();
}
void sys_hal_set_ana_reg28_value(uint32_t value)
{
    sys_ll_set_ana_reg28_value(value);
}

uint32_t sys_hal_get_ana_reg28_value(void)
{
    return sys_ll_get_ana_reg28_value();
}

void sys_hal_set_ana_reg29_value(uint32_t value)
{
    sys_ll_set_ana_reg29_value(value);
}
void sys_hal_set_ana_reg30_value(uint32_t value)
{
    sys_ll_set_ana_reg30_value(value);
}

uint32_t sys_hal_bias_reg_read(void)
{
	return 0;
}
uint32_t sys_hal_bias_reg_write(uint32_t param)
{
	return 0;
}
uint32_t sys_hal_analog_reg2_get(void)
{
	return 0;
}
uint32_t sys_hal_bias_reg_set(uint32_t param)
{
	return 0;
}
uint32_t sys_hal_bias_reg_clean(uint32_t param)
{
	return 0;
}
uint32_t sys_hal_get_xtalh_ctune(void)
{
	return sys_ll_get_ana_reg3_ctune();
}
uint32_t sys_hal_cali_bgcalm(void)
{
	uint32_t bandgap;

	sys_ll_set_ana_reg10_spi_latch1v(1);
	sys_ll_set_ana_reg9_pwd_bgcal(0);
	sys_ll_set_ana_reg9_vbgcalmode(0);
	sys_ll_set_ana_reg9_vbgcalstart(0);
	sys_ll_set_ana_reg9_vbgcalstart(1);
	bk_delay_us(100);//100us
	sys_ll_set_ana_reg9_vbgcalstart(0);

	bk_delay_us(2000);//2ms to avoid consistency issue

	bandgap = aon_pmu_ll_get_r7d_bgcal();

	sys_ll_set_ana_reg9_vbgcalmode(1);
	sys_ll_set_ana_reg9_pwd_bgcal(1);
	sys_ll_set_ana_reg10_spi_latch1v(0);

	return bandgap;
}

uint32_t sys_hal_get_bgcalm(void)
{
	return sys_ll_get_ana_reg9_bgcal();
}

void sys_hal_set_bgcalm(uint32_t value)
{
	sys_ll_set_ana_reg10_spi_latch1v(1);
	sys_ll_set_ana_reg9_bgcal(value);
	sys_ll_set_ana_reg10_spi_latch1v(0);
}
void sys_hal_set_audioen(uint32_t value)
{
	return;
}
void sys_hal_set_dpll_div_cksel(uint32_t value)
{
	return;
}
void sys_hal_set_dpll_reset(uint32_t value)
{
	return;
}
void sys_hal_set_gadc_ten(uint32_t value)
{
	return;
}
/**  WIFI End **/
/**  Audio Start  **/
void sys_hal_aud_select_clock(uint32_t value)
{
    sys_ll_set_cpu_clk_div_mode3_cksel_audio(value);
}
void sys_hal_aud_set_ckdiv_audio(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode3_ckdiv_audio(value);
}
void sys_hal_aud_clock_en(uint32_t value)
{
    sys_ll_set_reserver_reg0xd_audio_cken(value);
}

void sys_hal_aud_dacl_en(uint32_t value)
{
    sys_ll_set_ana_reg29_daclen(value);
}
void sys_hal_aud_diffen_en(uint32_t value)
{
	return;
}
void sys_hal_aud_mic_rst_set(uint32_t value)
{
	return;
}
void sys_hal_aud_mic1_en(uint32_t value)
{
    sys_ll_set_ana_reg21_micen_mic1(value);
}
void sys_hal_aud_mic1_rst_set(uint32_t value)
{
    sys_ll_set_ana_reg21_rst_mic1(value);
}
void sys_hal_aud_mic1_gain_set(uint32_t value)
{
    sys_ll_set_ana_reg21_micgain_mic1(value);
}
void sys_hal_aud_mic1_single_en(uint32_t value)
{
    sys_ll_set_ana_reg21_micsingleen_mic1(value);
}
void sys_hal_aud_dac_diffen_en(uint32_t value)
{
	sys_ll_set_ana_reg29_diffen(value);
}
void sys_hal_aud_dcoc_en(uint32_t value)
{
    sys_ll_set_ana_reg29_lendcoc(value);
}
void sys_hal_aud_lmdcin_set(uint32_t value)
{
	return;
}
void sys_hal_aud_audbias_en(uint32_t value)
{
	sys_ll_set_ana_reg20_enaudbias(value);
}
void sys_hal_aud_adcbias_en(uint32_t value)
{
    sys_ll_set_ana_reg20_enadcbias(value);
}
void sys_hal_aud_micbias_en(uint32_t value)
{
    sys_ll_set_ana_reg20_enmicbias(value);
}
void sys_hal_aud_dac_bias_en(uint32_t value)
{
    sys_ll_set_ana_reg30_enbs(value);
}
//void sys_hal_aud_idac_en(uint32_t value)
//{
//	return;
//}
void sys_hal_aud_idacl_en(uint32_t value)
{
	sys_ll_set_ana_reg30_enidacl(value);
}

void sys_hal_aud_idacr_en(uint32_t value)
{
	sys_ll_set_ana_reg30_enidacr(value);
}
void sys_hal_aud_dac_drv_en(uint32_t value)
{
    sys_ll_set_ana_reg29_dacdrven(value);
}

void sys_hal_aud_int_en(uint32_t value)
{
	//sys_ll_set_cpu0_int_0_31_en_aud_int(value); ///cm33
    sys_ll_set_cpu0_int_0_31_en_cpu0_aud_int_en(value);
}
void sys_hal_aud_power_en(uint32_t value)
{
	return;
}
void sys_hal_aud_lvcmd_en(uint32_t value)
{
	return;
}
void sys_hal_aud_micbias1v_en(uint32_t value)
{
	return;
}
void sys_hal_aud_micbias_trim_set(uint32_t value)
{
	return;
}
void sys_hal_aud_audpll_en(uint32_t value)
{
	return;
}
void sys_hal_aud_dacr_en(uint32_t value)
{
    sys_ll_set_ana_reg29_dacren(value);
}
void sys_hal_aud_vdd1v_en(uint32_t value)
{
	return;
}
void sys_hal_aud_vdd1v5_en(uint32_t value)
{
	return;
}
void sys_hal_aud_mic2_en(uint32_t value)
{
    sys_ll_set_ana_reg27_micen_mic2(value);
}
void sys_hal_aud_mic2_rst_set(uint32_t value)
{
    sys_ll_set_ana_reg27_rst_mic2(value);
}
void sys_hal_aud_mic2_gain_set(uint32_t value)
{
    sys_ll_set_ana_reg27_micgain_mic2(value);
}
void sys_hal_aud_mic2_single_en(uint32_t value)
{
    sys_ll_set_ana_reg27_micsingleen_mic2(value);
}
void sys_hal_aud_dacg_set(uint32_t value)
{
    sys_ll_set_ana_reg29_dacg(value);
}
void sys_hal_aud_aud_en(uint32_t value)
{
	return;
}
void sys_hal_aud_rvcmd_en(uint32_t value)
{
	return;
}
void sys_hal_dmic_clk_div_set(uint32_t value)
{
	return;
}
void sys_hal_aud_dac_dacmute_en(uint32_t value)
{
	return;
}
void sys_hal_aud_mic3_en(uint32_t value)
{
    sys_ll_set_ana_reg28_micen_mic3(value);
}
void sys_hal_aud_mic3_rst_set(uint32_t value)
{
    sys_ll_set_ana_reg28_rst_mic3(value);
}
void sys_hal_aud_mic3_gain_set(uint32_t value)
{
    sys_ll_set_ana_reg28_micgain_mic3(value);
}
void sys_hal_aud_mic3_single_en(uint32_t value)
{
    sys_ll_set_ana_reg28_micsingleen_mic3(value);
}
/**  Audio End  **/
/**  FFT Start  **/
void sys_hal_fft_disckg_set(uint32_t value)
{
	return;
}
void sys_hal_cpu_fft_int_en(uint32_t value)
{
	return;
}
/**  FFT End  **/
/**  I2S Start  **/
void sys_hal_i2s_select_clock(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s0(value);
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s1(value);
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s2(value);
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s3(value);
	sys_ll_set_cpu_clk_div_mode2_cksel_i2s4(value);
}
void sys_hal_i2s_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s0_cken(value);
}
void sys_hal_i2s1_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s1_cken(value);
}
void sys_hal_i2s2_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s2_cken(value);
}
void sys_hal_i2s3_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s3_cken(value);
}
void sys_hal_i2s4_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s4_cken(value);
}

void sys_hal_i2s_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_i2s0_int_en(value);
}
void sys_hal_i2s1_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_i2s1_int_en(value);
}
void sys_hal_i2s2_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_i2s2_int_en(value);
}
void sys_hal_i2s3_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_i2s3_int_en(value);
}
void sys_hal_i2s4_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_64_95_en_cpu0_i2s4_int_en(value);
}

void sys_hal_i2s_disckg_set(uint32_t value)
{
	return;
}
void sys_hal_apll_en(uint32_t value)  /// modify - 260105
{
	if(value == 0)
	{
		sys_ll_set_ana_reg5_pwdaudpll(1);
	}
	else
	{
		sys_ll_set_ana_reg5_pwdaudpll(0);
	}
    //sys_ll_set_ana_reg5_pwdaudpll(value);
}
void sys_hal_cb_manu_val_set(uint32_t value)
{
	return;
}
void sys_hal_ana_reg11_vsel_set(uint32_t value)
{
	return;
}
void sys_hal_apll_cal_val_set(uint32_t value)  /// modify - 260105
{
    //sys_ll_set_ana_reg26_value(value);
    sys_ll_set_ana_reg26_n(value);
	sys_ll_set_ana_reg26_calres_spien(0);
	sys_ll_set_ana_reg26_calrefen(1);
}
void sys_hal_apll_spi_trigger_set(uint32_t value)
{
    sys_ll_set_ana_reg25_spi_trigger(value);
}
void sys_hal_i2s0_ckdiv_set(uint32_t value)
{
	return;
}
void sys_hal_apll_config_set(uint32_t value)
{
	sys_ll_set_ana_reg25_value(value);///
	return;
}
/**  I2S End  **/
/**  Touch Start **/
void sys_hal_touch_power_down(uint32_t value)
{
	sys_ll_set_ana_reg32_pwd_td(value);
}
void sys_hal_touch_sensitivity_level_set(uint32_t value)
{
	sys_ll_set_ana_reg32_gain_s(value);
}
void sys_hal_touch_scan_mode_enable(uint32_t value)
{
	sys_ll_set_ana_reg33_en_scan(value);
}
void sys_hal_touch_detect_threshold_set(uint32_t value)
{
	sys_ll_set_ana_reg32_vrefs(value);
}
void sys_hal_touch_detect_range_set(uint32_t value)
{
	sys_ll_set_ana_reg32_crg(value);
}
void sys_hal_touch_calib_enable(uint32_t value)
{
	sys_ll_set_ana_reg33_en_cal_force(value);
}
void sys_hal_touch_cal_ctrl_set(uint32_t value)
{
	sys_ll_set_ana_reg32_cal_ctrl(value);
}
uint32_t sys_hal_touch_cal_ctrl_get(void)
{
	return sys_ll_get_ana_reg32_cal_ctrl();
}
void sys_hal_touch_cal_vth_set(uint32_t value)
{
	sys_ll_set_ana_reg32_cal_vth(value);
}
uint32_t sys_hal_touch_cal_vth_get(void)
{
	return sys_ll_get_ana_reg32_cal_vth();
}
void sys_hal_touch_rstb_dig_set(uint32_t value)
{
	sys_ll_set_ana_reg32_rstb_dig(value);
}
uint32_t sys_hal_touch_rstb_dig_get(void)
{
	return sys_ll_get_ana_reg32_rstb_dig();
}
void sys_hal_touch_ldoen_set(uint32_t value)
{
	sys_ll_set_ana_reg32_ldoen(value);
}
uint32_t sys_hal_touch_ldoen_get(void)
{
	return sys_ll_get_ana_reg32_ldoen();
}
void sys_hal_touch_cal_auto_set(uint32_t value)
{
	sys_ll_set_ana_reg33_en_cal_auto(value);
}
void sys_hal_touch_cal_done_clr(uint32_t value)
{
	sys_ll_set_ana_reg33_cal_done_clr(value);
}
void sys_hal_touch_manul_mode_calib_value_set(uint32_t value)
{
	sys_ll_set_ana_reg35_cap_calspi(value);
}
uint32_t sys_hal_touch_calib_value_get(void)
{
	return sys_ll_get_ana_reg35_cap_calspi();
}
void sys_hal_touch_manul_mode_enable(uint32_t value)
{
	sys_ll_set_ana_reg35_en_manmode(value);
}
void sys_hal_touch_scan_mode_chann_set(uint32_t value)
{
	sys_ll_set_ana_reg33_chs(value);
}
void sys_hal_touch_scan_mode_chann_sel(uint32_t value)
{
	sys_ll_set_ana_reg33_chs_sel_cal(value);
}
void sys_hal_touch_serial_cap_enable(void)
{
	sys_ll_set_ana_reg32_en_seri_cap(1);
}
void sys_hal_touch_serial_cap_disable(void)
{
	sys_ll_set_ana_reg32_en_seri_cap(0);
}
void sys_hal_touch_serial_cap_sel(uint32_t value)
{
	sys_ll_set_ana_reg32_sel_seri_cap(value);
}
void sys_hal_touch_spi_lock(void)
{
	sys_ll_set_ana_reg32_td_latch(0);
}
void sys_hal_touch_spi_unlock(void)
{
	sys_ll_set_ana_reg32_td_latch(1);
}
void sys_hal_touch_test_period_set(uint32_t value)
{
	sys_ll_set_ana_reg33_test_period(value);
}
void sys_hal_touch_test_number_set(uint32_t value)
{
	sys_ll_set_ana_reg33_test_number(value);
}
void sys_hal_touch_calib_period_set(uint32_t value)
{
	sys_ll_set_ana_reg34_cl_period(value);
}
uint32_t sys_hal_touch_calib_period_get(void)
{
	return sys_ll_get_ana_reg34_cl_period();
}
void sys_hal_touch_calib_number_set(uint32_t value)
{
	sys_ll_set_ana_reg34_cal_number(value);
}
uint32_t sys_hal_touch_calib_number_get(void)
{
	return sys_ll_get_ana_reg34_cal_number();
}
void sys_hal_touch_modsel_spi_set(uint32_t value)
{
	sys_ll_set_ana_reg34_modsel_spi(value);
}
uint32_t sys_hal_touch_modsel_spi_get(void)
{
	return sys_ll_get_ana_reg34_modsel_spi();
}
void sys_hal_touch_int_set(uint32_t value)
{
	sys_ll_set_ana_reg34_int_en(value);
}
void sys_hal_touch_int_clear(uint32_t value)
{
	sys_ll_set_ana_reg35_int_clr(value);
}
void sys_hal_touch_int_enable(uint32_t value)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_touched_int_en(value);
}
/**  Touch End **/
/** jpeg start **/
void sys_hal_set_jpeg_clk_sel(uint32_t value)
{
	return;
}
void sys_hal_set_clk_div_mode1_clkdiv_jpeg(uint32_t value)
{
	return;
}
void sys_hal_set_jpeg_disckg(uint32_t value)
{
	return;
}
void sys_hal_set_cpu_clk_div_mode1_clkdiv_bus(uint32_t value)
{
	return;
}
void sys_hal_video_power_en(uint32_t value)
{
	return;
}
void sys_hal_set_auxs_cis_clk_sel(uint32_t value)
{
	return;
}
void sys_hal_set_auxs_cis_clk_div(uint32_t value)
{
	return;
}
void sys_hal_set_jpeg_clk_en(uint32_t value)
{
	return;
}
void sys_hal_set_cis_auxs_clk_en(uint32_t value)
{
	return;
}
/** jpeg end **/
/** h264 Start **/
void sys_hal_set_h264_clk_en(uint32_t value)
{
	return;
}
/** h264 End **/
/**  psram Start **/
void sys_hal_psram_volstage_sel(uint32_t enable)
{
	return;
}
void sys_hal_psram_xtall_osc_enable(uint32_t enable)
{
	return;
}
void sys_hal_psram_doc_enable(uint32_t enable)
{
	return;
}
void sys_hal_psram_ldo_enable(uint32_t enable)
{
	sys_ll_set_ana_reg14_enpsram(enable);
}

uint32_t sys_hal_psram_ldo_status(void)
{
	return sys_ll_get_ana_reg14_enpsram();
}

void sys_hal_psram_dpll_enable(uint32_t enable)
{
	return;
}
void sys_hal_psram_clk_sel_with_id(uint32_t id, uint32_t value)
{
	if (id == PSRAM_ID_0)
	{
		sys_ahbp_ll_set_reg8_cksel_pram0(value);
	}
	else
	{
		sys_ahbp_ll_set_reg9_cksel_pram1(value);
	}
}
void sys_hal_psram_set_clkdiv_with_id(uint32_t id, uint32_t value)
{
	if (id == PSRAM_ID_0)
	{
		sys_ahbp_ll_set_reg8_ckdiv_pram0(value);
	}
	else
	{
		sys_ahbp_ll_set_reg9_ckdiv_pram1(value);
	}
}

