bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
void sys_hal_psram_psldo_vsel(uint32_t value)
{
	return;
}
void sys_hal_psram_psldo_vset(uint32_t output_voltage, uint32_t is_add_200mv)
{
	(void)is_add_200mv;
	sys_ll_set_ana_reg14_vpsramsel(output_voltage); //1.2v-1.95v

	return;
}
void sys_hal_psram_psram0_disckg(uint32_t value)
{
	sys_ahbp_ll_set_rega_pram0_cken(value);
	return;
}
void sys_hal_psram_psram1_disckg(uint32_t value)
{
	sys_ahbp_ll_set_rega_pram1_cken(value);
	return;
}
/**  psram End **/
/* REG_0x03:cpu_storage_connect_op_select->flash_sel:0: normal flash operation 1:flash download by spi,R/W,0x3[9]*/
uint32_t sys_hal_get_cpu_storage_connect_op_select_flash_sel(void)
{
	return sys_ll_get_cpu_storage_connect_op_select_flash_sel();
}

void sys_hal_set_cpu_storage_connect_op_select_flash_sel(uint32_t value)
{
	sys_ll_set_cpu_storage_connect_op_select_flash_sel(value);
}
__IRAM_SEC void sys_hal_set_sys2flsh_2wire(uint32_t value)
{
	return;
}
/** Ethernet start **/
#ifdef CONFIG_ETH
void sys_hal_enable_eth_int(uint32_t value)
{
	return;
}

void sys_hal_set_eth_clk_en(uint32_t value)
{
	sys_aonp_regd_t *r = (sys_aonp_regd_t *)(SOC_SYS_AONP_REG_BASE + (0xd << 2));
	r->auxs_enet_cken = value;
}
#endif
/** Ethernet End**/
void sys_hal_set_ana_trxt_tst_enable(uint32_t value)
{
	return;
}
void sys_hal_set_ana_scal_en(uint32_t value)
{
	return;
}
void sys_hal_set_ana_gadc_buf_ictrl(uint32_t value)
{
	return;
}
void sys_hal_set_ana_gadc_cmp_ictrl(uint32_t value)
{
	return;
}
void sys_hal_set_ana_pwd_gadc_buf(uint32_t value)
{
	return;
}
void sys_hal_set_ana_vref_sel(uint32_t value)
{
	return;
}
void sys_hal_set_ana_cb_cal_manu(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_en(value);
}
void sys_hal_set_ana_reg5_pwd_rosc_spi(uint32_t value)
{
    sys_ll_set_ana_reg5_pwd_rosc_spi(value);
}
void sys_hal_set_ana_cb_cal_trig(uint32_t value)
{
    sys_ll_set_ana_reg5_bcal_start(value);
}
void sys_hal_set_ana_vlsel_ldodig(uint32_t value)
{
	return;
}
void sys_hal_set_ana_vhsel_ldodig(uint32_t value)
{
	return;
}
void sys_hal_set_sdio_clk_en(uint32_t value)
{
	return;
}
void sys_hal_set_cpu0_sdio_int_en(uint32_t value)
{
	return;
}
void sys_hal_set_cpu1_sdio_int_en(uint32_t value)
{
	return;
}
void sys_hal_set_cpu2_sdio_int_en(uint32_t value)
{
	return;
}
void sys_hal_set_sdio_clk_div(uint32_t value)
{
	return;
}
uint32_t sys_hal_get_sdio_clk_div()
{
	return 0;
}
void sys_hal_set_sdio_clk_sel(uint32_t value)
{
	return;
}
uint32_t sys_hal_get_sdio_clk_sel()
{
	return 0;
}
void sys_hal_set_ana_vctrl_sysldo(uint32_t value)
{
	return;
}
void sys_hal_set_yuv_buf_clock_en(uint32_t value)
{
	return;
}
void sys_hal_set_h264_clock_en(uint32_t value)
{
	return;
}
void sys_hal_nmi_wdt_set_clk_div(uint32_t value)
{
	return;
}
__IRAM_SEC uint32_t sys_hal_nmi_wdt_get_clk_div(void)
{
	return 0;
}
void sys_hal_set_ana_cb_cal_manu_val(uint32_t value)
{
    sys_ll_set_ana_reg5_vbias(value);
}
void sys_hal_set_ana_reg11_apfms(uint32_t value)
{
	sys_ll_set_ana_reg12_apfms(value);
}
void sys_hal_set_ana_reg12_dpfms(uint32_t value)
{
	sys_ll_set_ana_reg13_dpfms(value);
}
static void sys_hal_delay(volatile uint32_t times)
{
	while(times--);
}

uint32_t sys_hal_cali_dpll(uint32_t param)
{
	sys_hal_cali_dpll_spi_trig_disable();

    if (!param)
    {
        sys_hal_delay(120);
    }
    else
    {
        sys_hal_delay(60);
    }

    sys_hal_cali_dpll_spi_trig_enable();
    sys_hal_cali_dpll_spi_detect_disable();

    if (!param)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

	sys_hal_cali_dpll_spi_detect_enable();

    if (!param)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }
	return 0;
}
static bk_err_t sys_hal_ap_clock_power_ctrl(power_module_state_t power_state)
{
	uint32_t regData = 0;
	if(power_state == POWER_MODULE_STATE_ON)
	{
		sys_ll_set_ana_reg10_spi_latch1v(1);
		sys_ll_set_ana_reg9_pwd_hsldo(0);
		sys_ll_set_ana_reg16_enhspw(1);
		sys_ll_set_ana_reg16_vcorehssel(0xA);//0.7+0.025*0xA=0.95v
		sys_ll_set_ana_reg10_spi_latch1v(0);

		/*"M55S Access Secure*/
		regData  = REG_READ(0x44050000 + 0xF*4);
		regData &= ~((0x1<<3)|(0x1<<2));
		regData |=  ((  0<<3)|(  0<<2));
		REG_WRITE(0x44050000 + 0xF*4, regData);

		/*M55:Default enable all the clock source for bringup */
		REG_WRITE(0x48000000 + 0xA*4, 0xFFFFFFFF);

		/*M55 cpu freq and bus 480M, subbus 240M */
		regData = REG_READ(0x48000000 + 0x8*4);
		regData |= 0x1 << 4;
		REG_WRITE(0x48000000 + 0x8*4, regData);

		regData = REG_READ(0x48000000 + 0x8*4);
		regData |= 0x0 << 2;
		regData |= 0x1 << 0;
		REG_WRITE(0x48000000 + 0x8*4, regData);
	}
	else
	{
		//aon_pmu_ll_set_r2_m55_rstn(1); // rstn release
		//aon_pmu_ll_set_r2_m55_clk_en(0); // clk enable

		//sys_ll_set_ana_reg14_enpsram(0);

		sys_ahbp_ll_set_rege_pwd_m55(1);

		sys_ll_set_ana_reg10_spi_latch1v(1);
		sys_ll_set_ana_reg16_enhspw(0);
		sys_ll_set_ana_reg9_pwd_hsldo(1);
		sys_ll_set_ana_reg10_spi_latch1v(0);
	}

	return BK_OK;
}
static bk_err_t sys_hal_m55_clock_power_init()
{
	uint32_t regData = 0;
	sys_ll_set_ana_reg10_spi_latch1v(1);
	sys_ll_set_ana_reg9_pwd_hsldo(1);
	//bk_delay_us(20);
	sys_ll_set_ana_reg9_pwd_hsldo(0);
	//bk_delay_us(200);
	sys_ll_set_ana_reg16_enhspw(1);
	//bk_delay_us(200);
	sys_ll_set_ana_reg16_vcorehssel(0xA);//0.7+0.025*0xA=0.95v
	//bk_delay_us(200);
	sys_ll_set_ana_reg10_spi_latch1v(0);

#if 1
	regData = REG_READ(0x44000000 + 0x2*4);
	regData &= ~((0x1F<<21)|(0x1<<19));
	regData |=  ((0x1F<<21)|(  0<<19));
	REG_WRITE(0x44000000 + 0x2*4, regData);
	//bk_delay_us(20);

	regData &= ~((0x1F<<21)|(0x1<<19));
	regData |=  ((0x1E<<21)|(  0<<19));
	REG_WRITE(0x44000000 + 0x2*4, regData);
	//bk_delay_us(20);

	regData &= ~((0x1F<<21)|(0x1<<19));
	regData |=  ((0x1C<<21)|(  0<<19));
	REG_WRITE(0x44000000 + 0x2*4, regData);
	//bk_delay_us(20);

	regData &= ~((0x1F<<21)|(0x1<<19));
	regData |=  ((0x18<<21)|(  0<<19));
	REG_WRITE(0x44000000 + 0x2*4, regData);
	//bk_delay_us(20);

	regData &= ~((0x1F<<21)|(0x1<<19));
	regData |=  ((0x10<<21)|(  0<<19));
	REG_WRITE(0x44000000 + 0x2*4, regData);
	//bk_delay_us(20);

