bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
	regData &= ~((0x1F<<21)|(0x1<<19));
	regData |=  ((0x00<<21)|(  0<<19));
	REG_WRITE(0x44000000 + 0x2*4, regData);
	//bk_delay_us(20);
	regData = REG_READ(0x44000000 + 0x2*4);
	regData &= ~((0x1<<18));
	regData |=  ((  1<<18));
	REG_WRITE(0x44000000 + 0x2*4, regData);
	//bk_delay_us(20);

	/* PMU M55S Clk On*/
	regData = REG_READ(0x44000000 + 0x2*4);
	regData &= ~((0x1<<20));
	regData |=  ((  1<<20));
	REG_WRITE(0x44000000 + 0x2*4, regData);

	/* PMU M55S RstN On*/
	regData = REG_READ(0x44000000 + 0x2*4);
	regData &= ~((0x1<<17));
	regData |=  ((  1<<17));
	REG_WRITE(0x44000000 + 0x2*4, regData);

	/*Wait HS LDO RstN On*/
	while(!REG_READ(0x44000000 + 0x74*4));

	/*PMU M55S ISO Off*/
	regData  = REG_READ(0x44000000 + 0x2*4);
	regData &= ~((0x1<<16));
	regData |=  ((0<<16));
	REG_WRITE(0x44000000 + 0x2*4, regData);

	/*"M55S Access Secure*/
	regData  = REG_READ(0x44050000 + 0xF*4);
	regData &= ~((0x1<<3)|(0x1<<2));
	regData |=  ((  0<<3)|(  0<<2));
	REG_WRITE(0x44050000 + 0xF*4, regData);

	/*PSRAM Enable*/
	sys_ll_set_ana_reg14_enpsram(1);
	//bk_delay_us(10);
	/*M55S Memory EMA switch to 1*/
	REG_WRITE(0x48000000 + 0x50*4,  (0x5A<<24) | (0x441<<10) | (0x241));
	REG_WRITE(0x48000000 + 0x50*4,  (0xA5<<24) | (0x441<<10) | (0x241));
	REG_WRITE(0x48000000 + 0x51*4,  (0x5A<<24) |               (0x901));
	REG_WRITE(0x48000000 + 0x51*4,  (0xA5<<24) |               (0x901));
	REG_WRITE(0x48000000 + 0x52*4,  (0x5A<<24) | (0x441<<10) | (0x241));
	REG_WRITE(0x48000000 + 0x52*4,  (0xA5<<24) | (0x441<<10) | (0x241));
	REG_WRITE(0x48000000 + 0x53*4,  (0x5A<<24) |               (0x901));
	REG_WRITE(0x48000000 + 0x53*4,  (0xA5<<24) |               (0x901));
	//bk_delay_us(10);
#endif
	/*M55:Default enable all the clock source for bringup */
	REG_WRITE(0x48000000 + 0xA*4, 0xFFFFFFFF);

	/*M55 cpu freq and bus 480M, subbus 240M */
	regData = REG_READ(0x48000000 + 0x8*4);
	regData |= 0x1 << 4;
	REG_WRITE(0x48000000 + 0x8*4, regData);

	regData = REG_READ(0x48000000 + 0x8*4);
	regData |= 0x0 << 2;
	regData |= 0x1 << 0;
	REG_WRITE(0x48000000 + 0x8*4, regData);
	//bk_delay_us(20);
	return BK_OK;
}
static void sys_hal_dpll_cpu_flash_time_early_init(uint32_t chip_id)
{
	/*Calibrate the dpll*/
	sys_hal_cali_dpll(0);

	/*Enable all the clock sources*/
	sys_ll_set_reserver_reg0xd_sig_240m_cken(1);
	sys_ll_set_reserver_reg0xd_sig_320m_cken(1);
	sys_ll_set_reserver_reg0xd_sig_480m_cken(1);
	sys_ll_set_reserver_reg0xd_sig_160m_cken(1);
	sys_ll_set_reserver_reg0xd_sig_120m_cken(1);

	/*Default enable all the clock source for bringup */
	REG_WRITE(SYS_CPU_DEVICE_CLK_ENABLE_ADDR, 0xFFFFFFFF);
	REG_WRITE(SYS_RESERVER_REG0XD_ADDR, 0xFFFFFFFF);

	/*Set the cpu clock div:default:240M*/
	sys_ll_set_cpu_clk_div_mode1_ckdiv_core(0x1);
	sys_ll_set_cpu_clk_div_mode1_cksel_core(0x3);

}

static void sys_hal_pwd_rosc()
{
	return;
}
void sys_hal_early_init(void)
{
	uint32_t chip_id;
	uint32_t val;
	chip_id = aon_pmu_hal_get_chipid();

	sys_ll_set_ana_reg10_spi_latch1v(1);

	sys_hal_analog_set(ANALOG_REG0, 0xC1385B56);
	sys_hal_analog_set(ANALOG_REG5, 0x640F836C);

	val = sys_hal_analog_get(ANALOG_REG0);
	val |= 0x1 << 26;
	sys_hal_analog_set(ANALOG_REG0,val);

	val = sys_hal_analog_get(ANALOG_REG0);
	val &= ~(0x1 << 26);
	sys_hal_analog_set(ANALOG_REG0,val);

	sys_hal_analog_set(ANALOG_REG2, 0x04248050); //wangjian20221110 xtal=0x50
	sys_hal_analog_set(ANALOG_REG3, 0xC5F00B88); //ronghui20241226 <10>=1 for xtal
	sys_hal_analog_set(ANALOG_REG4, 0x9FC9A7F0);
	sys_hal_analog_set(ANALOG_REG9, 0x57E627E6); //shuguang20241226 <8:6>=7 for EVM

	//if ((chip_id & PM_CHIP_ID_MASK) == (PM_CHIP_ID_BK7259 & PM_CHIP_ID_MASK))
	{
		sys_hal_analog_set(ANALOG_REG10, 0x786BC867 | (0x1<<9));
		sys_hal_analog_set(ANALOG_REG11, 0xC3DD4587);//siqing20260202 bit[27:25] = 1 for Reduce BUCK frequency to 1 MHz
		sys_hal_analog_set(ANALOG_REG12, 0x346E9878);
		sys_hal_analog_set(ANALOG_REG13, 0x346E9858);//siqing20260330 bit[5]=0 per V2 sys_ana.ini 0x4d: dzcdcal (bit4)=1, dzcdmsel (bit5)=0; do not set both to 1. Low-power BUCK_L discontinuous-current reverse conduction caused abnormal measured efficiency.
		sys_hal_analog_set(ANALOG_REG14, 0xF4E670EE);
		sys_hal_analog_set(ANALOG_REG15, 0);

		sys_hal_analog_set(ANALOG_REG16, 0x9E436000);
		sys_hal_analog_set(ANALOG_REG19, 0xEE1D8033);//tenglong20251231 bit[24:22] = 0 for evm;siqing20260202 bit[13:9] = 0 for Reduce buck ripple
	}

    sys_ll_set_ana_reg10_spi_latch1v(0);

	/*early init cpu flash time*/
	sys_hal_dpll_cpu_flash_time_early_init(chip_id);

	/*M55: clock power init*/
	#if 1//!CONFIG_PM_ONLY_CP_ENABLE && !CONFIG_PM_AP_POWERDOWN_WHEN_LV
	sys_hal_m55_clock_power_init();
	#endif
}
void sys_hal_set_7816_int_en(uint32_t core_index, uint32_t value)
{
	return;
}
void sys_hal_set_scr_clk(uint32_t value)
{
	return;
}
void sys_hal_set_cpu0_rxevt_sel(uint32_t param)
{
	return;
}
void sys_hal_set_cpu1_rxevt_sel(uint32_t param)
{
	return;
}
void sys_hal_set_cpu2_rxevt_sel(uint32_t param)
{
	return;
}
void sys_hal_set_cpu_device_clk_enable_otp_cken(uint32_t value)
{
	return;
}
void sys_hal_set_cpu_power_sleep_wakeup_ticktimer_32k_enable(uint32_t value)
{
	return sys_ll_set_cpu_power_sleep_wakeup_cpu0_ticktimer_32k_enable(value);
}

bk_err_t sys_hal_cpu_freq_dump()
{
	return BK_OK;
}

bk_err_t sys_hal_xdac_clk_en(uint8_t ch, uint8_t clk_en)
{
    bk_err_t ret = BK_OK;

    if(XDAC_0 == ch)
    {
        sys_ll_set_reserver_reg0xd_xdac0_cken(clk_en);
    }
    else if(XDAC_1 == ch)
    {
        sys_ll_set_reserver_reg0xd_xdac1_cken(clk_en);
    }
    else
    {
        ret = BK_ERR_XDAC_CH_INVALID;
    }

    return ret;

}

bk_err_t sys_hal_xdac_int_en(uint8_t cpu, uint8_t ch, uint8_t int_en)
{
    bk_err_t ret = BK_OK;

    if(0 == cpu)
    {
        if(XDAC_0 == ch)
        {
            sys_ll_set_cpu0_int_32_63_en_cpu0_xdac0_int_en(int_en);
        }
        else if(XDAC_1 == ch)
        {
            sys_ll_set_cpu0_int_32_63_en_cpu0_xdac1_int_en(int_en);
        }
        else
        {
            ret = BK_FAIL;
        }
    }
    else if(1 == cpu)
    {
        if(XDAC_0 == ch)
        {
            sys_ll_set_cpu1_int_32_63_en_cpu1_xdac0_int_en(int_en);
        }
        else if(XDAC_1 == ch)
        {
            sys_ll_set_cpu1_int_32_63_en_cpu1_xdac1_int_en(int_en);
        }
        else
        {
            ret = BK_FAIL;
        }
    }
    else
    {
        ret = BK_FAIL;
    }

    return ret;

