bekencorp/bk_avdk_smp/cp/middleware/soc/bk7259/hal/sys_hal.c
}

bk_err_t sys_hal_xdac_set_enspi(uint8_t ch, uint8_t enspi)
{
    bk_err_t ret = BK_OK;

    if(XDAC_0 == ch)
    {
        sys_ll_set_ana_reg39_enspi_i(enspi);
    }
    else if(XDAC_1 == ch)
    {
        sys_ll_set_ana_reg40_enspi_q(enspi);
    }
    else
    {
        ret = BK_FAIL;
    }

    return ret;

}

bk_err_t sys_hal_xdac_set_endigspi_sel(uint8_t ch, uint8_t endigspi_sel)
{
    bk_err_t ret = BK_OK;

    if(XDAC_0 == ch)
    {
        sys_ll_set_ana_reg39_endigspi_sel_i(endigspi_sel);
    }
    else if(XDAC_1 == ch)
    {
        sys_ll_set_ana_reg40_endigspi_sel_q(endigspi_sel);
    }
    else
    {
        ret = BK_FAIL;
    }

    return ret;

}

/** reg20 - AHB Peripheral Bus Master QoS Control **/

void sys_hal_set_psram_qos_value(uint32_t v)
{
	sys_ahbp_ll_set_reg20_value(v);
}

uint32_t sys_hal_get_psram_qos_value(void)
{
	return sys_ahbp_ll_get_reg20_value();
}

void sys_hal_set_psram_cpu0_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_cpu0_qos(v);
}

uint32_t sys_hal_get_psram_cpu0_qos(void)
{
	return sys_ahbp_ll_get_reg20_cpu0_qos();
}

void sys_hal_set_psram_dma1_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_dma1_qos(v);
}

uint32_t sys_hal_get_psram_dma1_qos(void)
{
	return sys_ahbp_ll_get_reg20_dma1_qos();
}

void sys_hal_set_psram_sdio0_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_sdio0_qos(v);
}

uint32_t sys_hal_get_psram_sdio0_qos(void)
{
	return sys_ahbp_ll_get_reg20_sdio0_qos();
}

void sys_hal_set_psram_sdio1_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_sdio1_qos(v);
}

uint32_t sys_hal_get_psram_sdio1_qos(void)
{
	return sys_ahbp_ll_get_reg20_sdio1_qos();
}

/* NOTE: enet0 QoS is marked as INVALID in hardware spec. Do NOT use. */
void sys_hal_set_psram_enet0_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_enet0_qos(v);
}

uint32_t sys_hal_get_psram_enet0_qos(void)
{
	return sys_ahbp_ll_get_reg20_enet0_qos();
}

/* NOTE: enet1 QoS is marked as INVALID in hardware spec. Do NOT use. */
void sys_hal_set_psram_enet1_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_enet1_qos(v);
}

uint32_t sys_hal_get_psram_enet1_qos(void)
{
	return sys_ahbp_ll_get_reg20_enet1_qos();
}

void sys_hal_set_psram_usb_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_usb_qos(v);
}

uint32_t sys_hal_get_psram_usb_qos(void)
{
	return sys_ahbp_ll_get_reg20_usb_qos();
}

void sys_hal_set_psram_h26e_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_h26e_qos(v);
}

uint32_t sys_hal_get_psram_h26e_qos(void)
{
	return sys_ahbp_ll_get_reg20_h26e_qos();
}

void sys_hal_set_psram_isp_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_isp_qos(v);
}

uint32_t sys_hal_get_psram_isp_qos(void)
{
	return sys_ahbp_ll_get_reg20_isp_qos();
}

void sys_hal_set_psram_videopost_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_videopost_qos(v);
}

uint32_t sys_hal_get_psram_videopost_qos(void)
{
	return sys_ahbp_ll_get_reg20_videopost_qos();
}

void sys_hal_set_psram_dpu_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_dpu_qos(v);
}

uint32_t sys_hal_get_psram_dpu_qos(void)
{
	return sys_ahbp_ll_get_reg20_dpu_qos();
}

void sys_hal_set_psram_cbus_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_cbus_qos(v);
}

uint32_t sys_hal_get_psram_cbus_qos(void)
{
	return sys_ahbp_ll_get_reg20_cbus_qos();
}

void sys_hal_set_psram_npu0_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_npu0_qos(v);
}

uint32_t sys_hal_get_psram_npu0_qos(void)
{
	return sys_ahbp_ll_get_reg20_npu0_qos();
}

void sys_hal_set_psram_npu1_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_npu1_qos(v);
}

uint32_t sys_hal_get_psram_npu1_qos(void)
{
	return sys_ahbp_ll_get_reg20_npu1_qos();
}

void sys_hal_set_psram_cpu1_qos(uint32_t v)
{
	sys_ahbp_ll_set_reg20_cpu1_qos(v);
}

uint32_t sys_hal_get_psram_cpu1_qos(void)
{
	return sys_ahbp_ll_get_reg20_cpu1_qos();
}
